{
  "config": {
    "min_freq": 2,
    "max_vocab_size": 50000,
    "special_tokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>"
    ],
    "lowercase": false
  },
  "token2id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    ";": 4,
    ")": 5,
    "(": 6,
    ",": 7,
    "NUM": 8,
    "->": 9,
    "=": 10,
    "VAR_2": 11,
    "{": 12,
    "}": 13,
    "[": 14,
    "]": 15,
    "*": 16,
    "if": 17,
    "VAR_4": 18,
    "VAR_6": 19,
    "VAR_5": 20,
    "VAR_3": 21,
    "&": 22,
    "VAR_7": 23,
    "VAR_8": 24,
    "VAR_9": 25,
    "STR": 26,
    "VAR_10": 27,
    "VAR_11": 28,
    ".": 29,
    "VAR_12": 30,
    "VAR_13": 31,
    ":": 32,
    "VAR_14": 33,
    "VAR_15": 34,
    "int": 35,
    "VAR_17": 36,
    "VAR_16": 37,
    "+": 38,
    "VAR_18": 39,
    "VAR_19": 40,
    "-": 41,
    "return": 42,
    "case": 43,
    "VAR_20": 44,
    "VAR_21": 45,
    "<": 46,
    "VAR_22": 47,
    "==": 48,
    "VAR_23": 49,
    "break": 50,
    "VAR_1": 51,
    "VAR_24": 52,
    "else": 53,
    "VAR_25": 54,
    "VAR_26": 55,
    "!": 56,
    "VAR_27": 57,
    "++": 58,
    "VAR_0": 59,
    "VAR_28": 60,
    "#": 61,
    "VAR_29": 62,
    "VAR_30": 63,
    "VAR_31": 64,
    "&&": 65,
    "VAR_32": 66,
    "NULL": 67,
    "for": 68,
    "VAR_33": 69,
    "VAR_34": 70,
    "VAR_35": 71,
    "VAR_36": 72,
    "static": 73,
    "VAR_37": 74,
    "void": 75,
    "!=": 76,
    "VAR_38": 77,
    ">>": 78,
    "VAR_39": 79,
    "const": 80,
    "goto": 81,
    "<<": 82,
    "VAR_41": 83,
    "VAR_40": 84,
    "+=": 85,
    "VAR_42": 86,
    "VAR_43": 87,
    "||": 88,
    "VAR_44": 89,
    "VAR_45": 90,
    "sizeof": 91,
    "VAR_46": 92,
    "VAR_47": 93,
    ">": 94,
    "VAR_48": 95,
    "|": 96,
    "VAR_49": 97,
    "VAR_50": 98,
    "char": 99,
    "VAR_51": 100,
    "VAR_52": 101,
    "VAR_53": 102,
    "VAR_56": 103,
    "VAR_54": 104,
    "VAR_55": 105,
    "VAR_57": 106,
    "/": 107,
    "CHAR": 108,
    "?": 109,
    "VAR_58": 110,
    "VAR_59": 111,
    "VAR_60": 112,
    ">=": 113,
    "VAR_61": 114,
    "VAR_62": 115,
    "VAR_63": 116,
    "unsigned": 117,
    "switch": 118,
    "\\": 119,
    "VAR_64": 120,
    "VAR_65": 121,
    "struct": 122,
    "VAR_66": 123,
    "VAR_67": 124,
    "VAR_69": 125,
    "VAR_68": 126,
    "|=": 127,
    "VAR_72": 128,
    "VAR_70": 129,
    "VAR_71": 130,
    "%": 131,
    "VAR_73": 132,
    "VAR_74": 133,
    "VAR_75": 134,
    "VAR_76": 135,
    "while": 136,
    "VAR_77": 137,
    "~": 138,
    "VAR_83": 139,
    "<=": 140,
    "VAR_78": 141,
    "VAR_80": 142,
    "VAR_79": 143,
    "fprintf": 144,
    "VAR_81": 145,
    "VAR_85": 146,
    "-=": 147,
    "VAR_82": 148,
    "VAR_84": 149,
    "VAR_86": 150,
    "VAR_90": 151,
    "VAR_88": 152,
    "VAR_89": 153,
    "VAR_92": 154,
    "VAR_91": 155,
    "memcpy": 156,
    "VAR_87": 157,
    "&=": 158,
    "true": 159,
    "VAR_93": 160,
    "memset": 161,
    "--": 162,
    "VAR_94": 163,
    "VAR_96": 164,
    "false": 165,
    "continue": 166,
    "VAR_95": 167,
    "strcmp": 168,
    "VAR_100": 169,
    "float": 170,
    "VAR_97": 171,
    "VAR_103": 172,
    "VAR_99": 173,
    "VAR_112": 174,
    "VAR_98": 175,
    "VAR_104": 176,
    "VAR_107": 177,
    "VAR_102": 178,
    "long": 179,
    "VAR_106": 180,
    "VAR_101": 181,
    "VAR_105": 182,
    "VAR_110": 183,
    "printf": 184,
    "VAR_108": 185,
    "VAR_114": 186,
    "VAR_109": 187,
    "VAR_122": 188,
    "VAR_115": 189,
    "VAR_111": 190,
    "VAR_121": 191,
    "VAR_117": 192,
    "VAR_125": 193,
    "VAR_113": 194,
    "VAR_120": 195,
    "VAR_118": 196,
    "VAR_119": 197,
    "VAR_124": 198,
    "double": 199,
    "VAR_123": 200,
    "VAR_116": 201,
    "snprintf": 202,
    "VAR_131": 203,
    "VAR_126": 204,
    "strlen": 205,
    "VAR_127": 206,
    "VAR_129": 207,
    "VAR_128": 208,
    "^": 209,
    "VAR_134": 210,
    "VAR_132": 211,
    "VAR_133": 212,
    "VAR_139": 213,
    "VAR_138": 214,
    "VAR_135": 215,
    "VAR_136": 216,
    "VAR_142": 217,
    "VAR_143": 218,
    "VAR_146": 219,
    "VAR_130": 220,
    "VAR_144": 221,
    "VAR_137": 222,
    "VAR_141": 223,
    "VAR_145": 224,
    "*=": 225,
    "enum": 226,
    "short": 227,
    "VAR_140": 228,
    "close": 229,
    "strncmp": 230,
    "signed": 231,
    "free": 232,
    "^=": 233,
    "memcmp": 234,
    "/=": 235,
    "sscanf": 236,
    "read": 237,
    "write": 238,
    "memmove": 239,
    "open": 240,
    "strcpy": 241,
    "fopen": 242,
    "fclose": 243,
    "malloc": 244,
    "strncpy": 245,
    "sprintf": 246,
    "alloca": 247,
    "%=": 248,
    "union": 249,
    "fread": 250,
    "fwrite": 251,
    "puts": 252,
    "strcat": 253,
    "calloc": 254,
    "fgets": 255,
    "realloc": 256,
    "vsnprintf": 257,
    "strncat": 258,
    "extern": 259,
    "scanf": 260,
    "memchr": 261,
    "fputs": 262,
    "fscanf": 263,
    "typedef": 264,
    "getchar": 265
  },
  "id2token": [
    "<PAD>",
    "<UNK>",
    "<BOS>",
    "<EOS>",
    ";",
    ")",
    "(",
    ",",
    "NUM",
    "->",
    "=",
    "VAR_2",
    "{",
    "}",
    "[",
    "]",
    "*",
    "if",
    "VAR_4",
    "VAR_6",
    "VAR_5",
    "VAR_3",
    "&",
    "VAR_7",
    "VAR_8",
    "VAR_9",
    "STR",
    "VAR_10",
    "VAR_11",
    ".",
    "VAR_12",
    "VAR_13",
    ":",
    "VAR_14",
    "VAR_15",
    "int",
    "VAR_17",
    "VAR_16",
    "+",
    "VAR_18",
    "VAR_19",
    "-",
    "return",
    "case",
    "VAR_20",
    "VAR_21",
    "<",
    "VAR_22",
    "==",
    "VAR_23",
    "break",
    "VAR_1",
    "VAR_24",
    "else",
    "VAR_25",
    "VAR_26",
    "!",
    "VAR_27",
    "++",
    "VAR_0",
    "VAR_28",
    "#",
    "VAR_29",
    "VAR_30",
    "VAR_31",
    "&&",
    "VAR_32",
    "NULL",
    "for",
    "VAR_33",
    "VAR_34",
    "VAR_35",
    "VAR_36",
    "static",
    "VAR_37",
    "void",
    "!=",
    "VAR_38",
    ">>",
    "VAR_39",
    "const",
    "goto",
    "<<",
    "VAR_41",
    "VAR_40",
    "+=",
    "VAR_42",
    "VAR_43",
    "||",
    "VAR_44",
    "VAR_45",
    "sizeof",
    "VAR_46",
    "VAR_47",
    ">",
    "VAR_48",
    "|",
    "VAR_49",
    "VAR_50",
    "char",
    "VAR_51",
    "VAR_52",
    "VAR_53",
    "VAR_56",
    "VAR_54",
    "VAR_55",
    "VAR_57",
    "/",
    "CHAR",
    "?",
    "VAR_58",
    "VAR_59",
    "VAR_60",
    ">=",
    "VAR_61",
    "VAR_62",
    "VAR_63",
    "unsigned",
    "switch",
    "\\",
    "VAR_64",
    "VAR_65",
    "struct",
    "VAR_66",
    "VAR_67",
    "VAR_69",
    "VAR_68",
    "|=",
    "VAR_72",
    "VAR_70",
    "VAR_71",
    "%",
    "VAR_73",
    "VAR_74",
    "VAR_75",
    "VAR_76",
    "while",
    "VAR_77",
    "~",
    "VAR_83",
    "<=",
    "VAR_78",
    "VAR_80",
    "VAR_79",
    "fprintf",
    "VAR_81",
    "VAR_85",
    "-=",
    "VAR_82",
    "VAR_84",
    "VAR_86",
    "VAR_90",
    "VAR_88",
    "VAR_89",
    "VAR_92",
    "VAR_91",
    "memcpy",
    "VAR_87",
    "&=",
    "true",
    "VAR_93",
    "memset",
    "--",
    "VAR_94",
    "VAR_96",
    "false",
    "continue",
    "VAR_95",
    "strcmp",
    "VAR_100",
    "float",
    "VAR_97",
    "VAR_103",
    "VAR_99",
    "VAR_112",
    "VAR_98",
    "VAR_104",
    "VAR_107",
    "VAR_102",
    "long",
    "VAR_106",
    "VAR_101",
    "VAR_105",
    "VAR_110",
    "printf",
    "VAR_108",
    "VAR_114",
    "VAR_109",
    "VAR_122",
    "VAR_115",
    "VAR_111",
    "VAR_121",
    "VAR_117",
    "VAR_125",
    "VAR_113",
    "VAR_120",
    "VAR_118",
    "VAR_119",
    "VAR_124",
    "double",
    "VAR_123",
    "VAR_116",
    "snprintf",
    "VAR_131",
    "VAR_126",
    "strlen",
    "VAR_127",
    "VAR_129",
    "VAR_128",
    "^",
    "VAR_134",
    "VAR_132",
    "VAR_133",
    "VAR_139",
    "VAR_138",
    "VAR_135",
    "VAR_136",
    "VAR_142",
    "VAR_143",
    "VAR_146",
    "VAR_130",
    "VAR_144",
    "VAR_137",
    "VAR_141",
    "VAR_145",
    "*=",
    "enum",
    "short",
    "VAR_140",
    "close",
    "strncmp",
    "signed",
    "free",
    "^=",
    "memcmp",
    "/=",
    "sscanf",
    "read",
    "write",
    "memmove",
    "open",
    "strcpy",
    "fopen",
    "fclose",
    "malloc",
    "strncpy",
    "sprintf",
    "alloca",
    "%=",
    "union",
    "fread",
    "fwrite",
    "puts",
    "strcat",
    "calloc",
    "fgets",
    "realloc",
    "vsnprintf",
    "strncat",
    "extern",
    "scanf",
    "memchr",
    "fputs",
    "fscanf",
    "typedef",
    "getchar"
  ],
  "token_freqs": {
    "<PAD>": 0,
    "<UNK>": 0,
    "<BOS>": 0,
    "<EOS>": 0,
    ";": 615463,
    ")": 569211,
    "(": 569202,
    ",": 466755,
    "NUM": 387956,
    "->": 349810,
    "=": 281008,
    "VAR_2": 173745,
    "{": 150191,
    "}": 144864,
    "[": 143577,
    "]": 143577,
    "*": 139099,
    "if": 121230,
    "VAR_4": 119828,
    "VAR_6": 97842,
    "VAR_5": 94936,
    "VAR_3": 92838,
    "&": 91010,
    "VAR_7": 89823,
    "VAR_8": 88899,
    "VAR_9": 87324,
    "STR": 77813,
    "VAR_10": 75534,
    "VAR_11": 71329,
    ".": 70912,
    "VAR_12": 70779,
    "VAR_13": 64075,
    ":": 59827,
    "VAR_14": 58681,
    "VAR_15": 57968,
    "int": 54470,
    "VAR_17": 52113,
    "VAR_16": 51712,
    "+": 50130,
    "VAR_18": 47677,
    "VAR_19": 44101,
    "-": 43874,
    "return": 41930,
    "case": 41834,
    "VAR_20": 41639,
    "VAR_21": 39721,
    "<": 35630,
    "VAR_22": 35513,
    "==": 34972,
    "VAR_23": 34534,
    "break": 32146,
    "VAR_1": 31540,
    "VAR_24": 31288,
    "else": 29906,
    "VAR_25": 29129,
    "VAR_26": 27936,
    "!": 27260,
    "VAR_27": 26463,
    "++": 26226,
    "VAR_0": 26129,
    "VAR_28": 24029,
    "#": 22463,
    "VAR_29": 22287,
    "VAR_30": 21857,
    "VAR_31": 20931,
    "&&": 20296,
    "VAR_32": 19505,
    "NULL": 18791,
    "for": 18752,
    "VAR_33": 18548,
    "VAR_34": 18137,
    "VAR_35": 17040,
    "VAR_36": 16627,
    "static": 16429,
    "VAR_37": 15972,
    "void": 15815,
    "!=": 15740,
    "VAR_38": 15276,
    ">>": 14904,
    "VAR_39": 14781,
    "const": 14562,
    "goto": 14133,
    "<<": 13750,
    "VAR_41": 13599,
    "VAR_40": 13295,
    "+=": 13293,
    "VAR_42": 13155,
    "VAR_43": 13063,
    "||": 12978,
    "VAR_44": 12403,
    "VAR_45": 12016,
    "sizeof": 11958,
    "VAR_46": 11737,
    "VAR_47": 11012,
    ">": 10645,
    "VAR_48": 10372,
    "|": 10275,
    "VAR_49": 10219,
    "VAR_50": 9735,
    "char": 9090,
    "VAR_51": 8944,
    "VAR_52": 8729,
    "VAR_53": 8516,
    "VAR_56": 8487,
    "VAR_54": 8106,
    "VAR_55": 7819,
    "VAR_57": 7708,
    "/": 7450,
    "CHAR": 7358,
    "?": 7177,
    "VAR_58": 7135,
    "VAR_59": 6815,
    "VAR_60": 6748,
    ">=": 6594,
    "VAR_61": 6247,
    "VAR_62": 5882,
    "VAR_63": 5692,
    "unsigned": 5647,
    "switch": 5628,
    "\\": 5626,
    "VAR_64": 5512,
    "VAR_65": 5459,
    "struct": 5409,
    "VAR_66": 5259,
    "VAR_67": 5173,
    "VAR_69": 5119,
    "VAR_68": 5066,
    "|=": 5010,
    "VAR_72": 4757,
    "VAR_70": 4713,
    "VAR_71": 4484,
    "%": 4281,
    "VAR_73": 4076,
    "VAR_74": 3857,
    "VAR_75": 3795,
    "VAR_76": 3780,
    "while": 3772,
    "VAR_77": 3652,
    "~": 3600,
    "VAR_83": 3596,
    "<=": 3522,
    "VAR_78": 3503,
    "VAR_80": 3418,
    "VAR_79": 3251,
    "fprintf": 3020,
    "VAR_81": 2989,
    "VAR_85": 2962,
    "-=": 2940,
    "VAR_82": 2909,
    "VAR_84": 2749,
    "VAR_86": 2723,
    "VAR_90": 2585,
    "VAR_88": 2509,
    "VAR_89": 2405,
    "VAR_92": 2388,
    "VAR_91": 2352,
    "memcpy": 2340,
    "VAR_87": 2320,
    "&=": 2249,
    "true": 2230,
    "VAR_93": 2222,
    "memset": 2216,
    "--": 2072,
    "VAR_94": 2069,
    "VAR_96": 1997,
    "false": 1984,
    "continue": 1946,
    "VAR_95": 1860,
    "strcmp": 1824,
    "VAR_100": 1823,
    "float": 1820,
    "VAR_97": 1818,
    "VAR_103": 1786,
    "VAR_99": 1786,
    "VAR_112": 1767,
    "VAR_98": 1759,
    "VAR_104": 1651,
    "VAR_107": 1637,
    "VAR_102": 1634,
    "long": 1631,
    "VAR_106": 1608,
    "VAR_101": 1593,
    "VAR_105": 1531,
    "VAR_110": 1502,
    "printf": 1391,
    "VAR_108": 1372,
    "VAR_114": 1367,
    "VAR_109": 1353,
    "VAR_122": 1318,
    "VAR_115": 1299,
    "VAR_111": 1263,
    "VAR_121": 1239,
    "VAR_117": 1236,
    "VAR_125": 1228,
    "VAR_113": 1118,
    "VAR_120": 1110,
    "VAR_118": 1108,
    "VAR_119": 1085,
    "VAR_124": 1082,
    "double": 1080,
    "VAR_123": 1076,
    "VAR_116": 1062,
    "snprintf": 1014,
    "VAR_131": 963,
    "VAR_126": 946,
    "strlen": 934,
    "VAR_127": 865,
    "VAR_129": 861,
    "VAR_128": 850,
    "^": 817,
    "VAR_134": 798,
    "VAR_132": 767,
    "VAR_133": 765,
    "VAR_139": 727,
    "VAR_138": 721,
    "VAR_135": 712,
    "VAR_136": 708,
    "VAR_142": 703,
    "VAR_143": 694,
    "VAR_146": 682,
    "VAR_130": 681,
    "VAR_144": 668,
    "VAR_137": 655,
    "VAR_141": 622,
    "VAR_145": 620,
    "*=": 606,
    "enum": 573,
    "short": 573,
    "VAR_140": 541,
    "close": 450,
    "strncmp": 398,
    "signed": 347,
    "free": 323,
    "^=": 296,
    "memcmp": 291,
    "/=": 262,
    "sscanf": 193,
    "read": 171,
    "write": 171,
    "memmove": 155,
    "open": 141,
    "strcpy": 137,
    "fopen": 112,
    "fclose": 110,
    "malloc": 105,
    "strncpy": 80,
    "sprintf": 74,
    "alloca": 68,
    "%=": 55,
    "union": 44,
    "fread": 37,
    "fwrite": 34,
    "puts": 29,
    "strcat": 27,
    "calloc": 17,
    "fgets": 17,
    "realloc": 16,
    "vsnprintf": 15,
    "strncat": 14,
    "extern": 13,
    "scanf": 8,
    "memchr": 7,
    "fputs": 6,
    "fscanf": 6,
    "typedef": 4,
    "getchar": 2
  }
}