{
  "config": {
    "min_freq": 2,
    "max_vocab_size": 50000,
    "special_tokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>"
    ],
    "lowercase": false
  },
  "token2id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    ";": 4,
    "(": 5,
    ")": 6,
    ",": 7,
    "-": 8,
    "=": 9,
    "NUM": 10,
    ">": 11,
    "VAR_2": 12,
    "\"": 13,
    "{": 14,
    "}": 15,
    "[": 16,
    "]": 17,
    "*": 18,
    "&": 19,
    "if": 20,
    "VAR_4": 21,
    "+": 22,
    "VAR_6": 23,
    "VAR_5": 24,
    "VAR_3": 25,
    "VAR_7": 26,
    "VAR_8": 27,
    "VAR_9": 28,
    ".": 29,
    "VAR_10": 30,
    "VAR_12": 31,
    ":": 32,
    "VAR_11": 33,
    "%": 34,
    "<": 35,
    "VAR_13": 36,
    "VAR_14": 37,
    "VAR_15": 38,
    "\\": 39,
    "VAR_16": 40,
    "VAR_17": 41,
    "int": 42,
    "VAR_18": 43,
    "VAR_19": 44,
    "VAR_20": 45,
    "!": 46,
    "VAR_21": 47,
    "return": 48,
    "case": 49,
    "|": 50,
    "VAR_22": 51,
    "VAR_23": 52,
    "VAR_24": 53,
    "VAR_25": 54,
    "break": 55,
    "VAR_1": 56,
    "VAR_26": 57,
    "else": 58,
    "VAR_27": 59,
    "VAR_28": 60,
    "VAR_29": 61,
    "VAR_0": 62,
    "VAR_31": 63,
    "VAR_30": 64,
    "VAR_32": 65,
    "#": 66,
    "VAR_33": 67,
    "VAR_34": 68,
    "VAR_35": 69,
    "for": 70,
    "'": 71,
    "VAR_36": 72,
    "VAR_37": 73,
    "NULL": 74,
    "VAR_39": 75,
    "VAR_38": 76,
    "VAR_41": 77,
    "VAR_40": 78,
    "static": 79,
    "void": 80,
    "VAR_43": 81,
    "VAR_42": 82,
    "VAR_44": 83,
    "VAR_45": 84,
    "VAR_46": 85,
    "const": 86,
    "goto": 87,
    "VAR_48": 88,
    "VAR_47": 89,
    "VAR_49": 90,
    "VAR_51": 91,
    "sizeof": 92,
    "VAR_50": 93,
    "VAR_52": 94,
    "VAR_53": 95,
    "VAR_55": 96,
    "VAR_54": 97,
    "/": 98,
    "VAR_57": 99,
    "VAR_58": 100,
    "VAR_56": 101,
    "VAR_59": 102,
    "char": 103,
    "VAR_60": 104,
    "VAR_62": 105,
    "VAR_61": 106,
    "VAR_63": 107,
    "VAR_65": 108,
    "VAR_66": 109,
    "?": 110,
    "VAR_64": 111,
    "VAR_69": 112,
    "VAR_67": 113,
    "VAR_70": 114,
    "VAR_68": 115,
    "VAR_71": 116,
    "VAR_74": 117,
    "VAR_72": 118,
    "VAR_75": 119,
    "VAR_76": 120,
    "VAR_73": 121,
    "unsigned": 122,
    "switch": 123,
    "VAR_77": 124,
    "struct": 125,
    "VAR_78": 126,
    "VAR_79": 127,
    "VAR_80": 128,
    "VAR_81": 129,
    "VAR_82": 130,
    "VAR_83": 131,
    "VAR_84": 132,
    "VAR_85": 133,
    "VAR_92": 134,
    "VAR_86": 135,
    "VAR_88": 136,
    "VAR_87": 137,
    "while": 138,
    "VAR_90": 139,
    "VAR_89": 140,
    "VAR_91": 141,
    "VAR_93": 142,
    "VAR_94": 143,
    "VAR_98": 144,
    "~": 145,
    "VAR_95": 146,
    "VAR_99": 147,
    "VAR_96": 148,
    "VAR_97": 149,
    "VAR_101": 150,
    "VAR_100": 151,
    "VAR_102": 152,
    "VAR_112": 153,
    "VAR_104": 154,
    "VAR_103": 155,
    "VAR_111": 156,
    "VAR_107": 157,
    "VAR_110": 158,
    "VAR_106": 159,
    "VAR_105": 160,
    "VAR_109": 161,
    "VAR_113": 162,
    "VAR_108": 163,
    "true": 164,
    "VAR_114": 165,
    "VAR_117": 166,
    "VAR_119": 167,
    "VAR_127": 168,
    "false": 169,
    "VAR_116": 170,
    "VAR_125": 171,
    "VAR_115": 172,
    "continue": 173,
    "VAR_121": 174,
    "VAR_124": 175,
    "VAR_120": 176,
    "VAR_118": 177,
    "VAR_128": 178,
    "float": 179,
    "VAR_126": 180,
    "VAR_123": 181,
    "$": 182,
    "VAR_122": 183,
    "long": 184,
    "VAR_129": 185,
    "VAR_130": 186,
    "VAR_132": 187,
    "VAR_131": 188,
    "VAR_135": 189,
    "VAR_133": 190,
    "VAR_147": 191,
    "VAR_134": 192,
    "VAR_144": 193,
    "VAR_138": 194,
    "VAR_136": 195,
    "VAR_148": 196,
    "VAR_142": 197,
    "VAR_137": 198,
    "VAR_140": 199,
    "^": 200,
    "VAR_145": 201,
    "VAR_149": 202,
    "VAR_139": 203,
    "VAR_152": 204,
    "VAR_157": 205,
    "VAR_158": 206,
    "VAR_143": 207,
    "VAR_141": 208,
    "VAR_150": 209,
    "VAR_146": 210,
    "double": 211,
    "VAR_160": 212,
    "VAR_151": 213,
    "VAR_163": 214,
    "VAR_153": 215,
    "VAR_168": 216,
    "VAR_165": 217,
    "VAR_164": 218,
    "VAR_155": 219,
    "VAR_156": 220,
    "VAR_154": 221,
    "VAR_159": 222,
    "VAR_169": 223,
    "VAR_184": 224,
    "VAR_161": 225,
    "VAR_162": 226,
    "VAR_187": 227,
    "VAR_167": 228,
    "VAR_192": 229,
    "VAR_182": 230,
    "VAR_171": 231,
    "VAR_174": 232,
    "VAR_178": 233,
    "VAR_172": 234,
    "VAR_166": 235,
    "VAR_189": 236,
    "VAR_170": 237,
    "VAR_179": 238,
    "VAR_176": 239,
    "VAR_191": 240,
    "VAR_173": 241,
    "short": 242,
    "VAR_180": 243,
    "VAR_177": 244,
    "VAR_188": 245,
    "VAR_186": 246,
    "VAR_205": 247,
    "VAR_175": 248,
    "VAR_181": 249,
    "VAR_190": 250,
    "VAR_196": 251,
    "VAR_183": 252,
    "VAR_194": 253,
    "enum": 254,
    "VAR_185": 255,
    "VAR_193": 256,
    "VAR_198": 257,
    "VAR_197": 258,
    "VAR_195": 259,
    "VAR_202": 260,
    "VAR_199": 261,
    "VAR_201": 262,
    "VAR_203": 263,
    "VAR_200": 264,
    "VAR_204": 265,
    "VAR_212": 266,
    "VAR_224": 267,
    "VAR_206": 268,
    "VAR_211": 269,
    "VAR_220": 270,
    "VAR_207": 271,
    "VAR_228": 272,
    "signed": 273,
    "VAR_215": 274,
    "VAR_229": 275,
    "VAR_233": 276,
    "VAR_209": 277,
    "VAR_225": 278,
    "VAR_226": 279,
    "VAR_213": 280,
    "VAR_234": 281,
    "VAR_208": 282,
    "VAR_210": 283,
    "VAR_214": 284,
    "VAR_216": 285,
    "VAR_270": 286,
    "VAR_227": 287,
    "VAR_221": 288,
    "VAR_230": 289,
    "VAR_218": 290,
    "VAR_222": 291,
    "VAR_236": 292,
    "VAR_266": 293,
    "VAR_217": 294,
    "VAR_219": 295,
    "VAR_223": 296,
    "VAR_231": 297,
    "VAR_235": 298,
    "VAR_239": 299,
    "VAR_272": 300,
    "VAR_232": 301,
    "VAR_241": 302,
    "VAR_258": 303,
    "VAR_240": 304,
    "VAR_273": 305,
    "VAR_260": 306,
    "VAR_237": 307,
    "VAR_261": 308,
    "VAR_263": 309,
    "VAR_274": 310,
    "VAR_269": 311,
    "VAR_286": 312,
    "VAR_265": 313,
    "VAR_278": 314,
    "VAR_275": 315,
    "VAR_248": 316,
    "VAR_303": 317,
    "VAR_268": 318,
    "VAR_277": 319,
    "VAR_238": 320,
    "VAR_244": 321,
    "VAR_366": 322,
    "VAR_250": 323,
    "VAR_271": 324,
    "VAR_253": 325,
    "@": 326,
    "VAR_291": 327,
    "VAR_242": 328,
    "VAR_284": 329,
    "VAR_267": 330,
    "VAR_294": 331,
    "VAR_254": 332,
    "VAR_298": 333,
    "VAR_255": 334,
    "VAR_247": 335,
    "VAR_282": 336,
    "VAR_309": 337,
    "VAR_243": 338,
    "VAR_317": 339,
    "VAR_365": 340,
    "VAR_251": 341,
    "VAR_249": 342,
    "VAR_262": 343,
    "VAR_256": 344,
    "VAR_246": 345,
    "VAR_285": 346,
    "VAR_252": 347,
    "VAR_279": 348,
    "VAR_305": 349,
    "VAR_245": 350,
    "VAR_283": 351,
    "VAR_301": 352,
    "VAR_300": 353,
    "VAR_307": 354,
    "VAR_308": 355,
    "VAR_276": 356,
    "VAR_299": 357,
    "VAR_296": 358,
    "VAR_259": 359,
    "VAR_304": 360,
    "VAR_313": 361,
    "VAR_257": 362,
    "VAR_293": 363,
    "VAR_280": 364,
    "VAR_281": 365,
    "VAR_297": 366,
    "VAR_332": 367,
    "VAR_295": 368,
    "VAR_264": 369,
    "VAR_287": 370,
    "VAR_302": 371,
    "VAR_310": 372,
    "VAR_306": 373,
    "VAR_315": 374,
    "VAR_362": 375,
    "VAR_292": 376,
    "VAR_288": 377,
    "VAR_289": 378,
    "VAR_290": 379,
    "VAR_316": 380,
    "VAR_312": 381,
    "VAR_357": 382,
    "VAR_343": 383,
    "VAR_374": 384,
    "VAR_337": 385,
    "VAR_326": 386,
    "VAR_356": 387,
    "VAR_321": 388,
    "VAR_364": 389,
    "VAR_370": 390,
    "VAR_314": 391,
    "VAR_369": 392,
    "VAR_324": 393,
    "VAR_333": 394,
    "VAR_311": 395,
    "VAR_341": 396,
    "VAR_358": 397,
    "VAR_367": 398,
    "VAR_376": 399,
    "VAR_320": 400,
    "VAR_346": 401,
    "VAR_385": 402,
    "VAR_330": 403,
    "VAR_718": 404,
    "VAR_329": 405,
    "VAR_348": 406,
    "VAR_353": 407,
    "VAR_419": 408,
    "VAR_319": 409,
    "VAR_327": 410,
    "VAR_373": 411,
    "VAR_603": 412,
    "VAR_322": 413,
    "VAR_318": 414,
    "VAR_350": 415,
    "VAR_415": 416,
    "VAR_452": 417,
    "VAR_336": 418,
    "VAR_372": 419,
    "VAR_711": 420,
    "VAR_328": 421,
    "VAR_472": 422,
    "VAR_349": 423,
    "VAR_382": 424,
    "VAR_446": 425,
    "VAR_477": 426,
    "VAR_347": 427,
    "VAR_354": 428,
    "VAR_359": 429,
    "VAR_325": 430,
    "VAR_323": 431,
    "VAR_361": 432,
    "VAR_363": 433,
    "VAR_609": 434,
    "VAR_345": 435,
    "VAR_377": 436,
    "VAR_420": 437,
    "VAR_355": 438,
    "VAR_360": 439,
    "VAR_334": 440,
    "VAR_368": 441,
    "VAR_344": 442,
    "VAR_335": 443,
    "VAR_585": 444,
    "VAR_352": 445,
    "VAR_378": 446,
    "VAR_331": 447,
    "VAR_342": 448,
    "VAR_339": 449,
    "VAR_340": 450,
    "VAR_486": 451,
    "VAR_418": 452,
    "VAR_541": 453,
    "VAR_400": 454,
    "VAR_495": 455,
    "VAR_375": 456,
    "VAR_381": 457,
    "VAR_426": 458,
    "VAR_351": 459,
    "VAR_478": 460,
    "VAR_379": 461,
    "VAR_386": 462,
    "VAR_454": 463,
    "VAR_524": 464,
    "VAR_591": 465,
    "VAR_744": 466,
    "VAR_390": 467,
    "VAR_387": 468,
    "VAR_413": 469,
    "VAR_611": 470,
    "VAR_394": 471,
    "VAR_399": 472,
    "VAR_598": 473,
    "VAR_371": 474,
    "VAR_384": 475,
    "VAR_469": 476,
    "VAR_338": 477,
    "VAR_380": 478,
    "VAR_422": 479,
    "VAR_395": 480,
    "VAR_412": 481,
    "VAR_538": 482,
    "VAR_616": 483,
    "VAR_388": 484,
    "VAR_383": 485,
    "VAR_507": 486,
    "VAR_401": 487,
    "VAR_428": 488,
    "VAR_613": 489,
    "VAR_575": 490,
    "VAR_606": 491,
    "VAR_443": 492,
    "VAR_594": 493,
    "VAR_396": 494,
    "VAR_473": 495,
    "VAR_562": 496,
    "VAR_405": 497,
    "VAR_479": 498,
    "VAR_676": 499,
    "VAR_453": 500,
    "VAR_468": 501,
    "VAR_508": 502,
    "VAR_531": 503,
    "VAR_542": 504,
    "VAR_554": 505,
    "VAR_576": 506,
    "VAR_389": 507,
    "VAR_494": 508,
    "VAR_577": 509,
    "VAR_392": 510,
    "VAR_393": 511,
    "VAR_402": 512,
    "VAR_612": 513,
    "VAR_572": 514,
    "VAR_678": 515,
    "VAR_720": 516,
    "VAR_423": 517,
    "VAR_424": 518,
    "VAR_480": 519,
    "VAR_680": 520,
    "VAR_845": 521,
    "VAR_404": 522,
    "VAR_528": 523,
    "VAR_543": 524,
    "VAR_545": 525,
    "VAR_569": 526,
    "VAR_648": 527,
    "VAR_398": 528,
    "VAR_455": 529,
    "VAR_530": 530,
    "VAR_391": 531,
    "VAR_409": 532,
    "VAR_414": 533,
    "VAR_421": 534,
    "VAR_431": 535,
    "VAR_534": 536,
    "VAR_581": 537,
    "VAR_433": 538,
    "VAR_447": 539,
    "VAR_466": 540,
    "VAR_573": 541,
    "VAR_604": 542,
    "VAR_670": 543,
    "VAR_708": 544,
    "VAR_522": 545,
    "VAR_599": 546,
    "union": 547,
    "VAR_406": 548,
    "VAR_539": 549,
    "VAR_549": 550,
    "VAR_553": 551,
    "VAR_597": 552,
    "VAR_722": 553,
    "VAR_411": 554,
    "VAR_537": 555,
    "VAR_608": 556,
    "VAR_713": 557,
    "VAR_417": 558,
    "VAR_430": 559,
    "VAR_450": 560,
    "VAR_532": 561,
    "VAR_610": 562,
    "VAR_620": 563,
    "VAR_673": 564,
    "VAR_714": 565,
    "VAR_521": 566,
    "VAR_568": 567,
    "VAR_1153": 568,
    "VAR_516": 569,
    "VAR_592": 570,
    "VAR_702": 571,
    "VAR_403": 572,
    "VAR_425": 573,
    "VAR_448": 574,
    "VAR_461": 575,
    "VAR_492": 576,
    "VAR_504": 577,
    "VAR_540": 578,
    "VAR_570": 579,
    "VAR_571": 580,
    "VAR_847": 581,
    "VAR_1062": 582,
    "VAR_429": 583,
    "VAR_436": 584,
    "VAR_437": 585,
    "VAR_442": 586,
    "VAR_460": 587,
    "VAR_523": 588,
    "VAR_617": 589,
    "VAR_623": 590,
    "VAR_843": 591,
    "VAR_397": 592,
    "VAR_427": 593,
    "VAR_435": 594,
    "VAR_509": 595,
    "VAR_615": 596,
    "VAR_655": 597,
    "VAR_681": 598,
    "VAR_691": 599,
    "VAR_703": 600,
    "VAR_974": 601,
    "VAR_503": 602,
    "VAR_628": 603,
    "VAR_659": 604,
    "VAR_962": 605,
    "VAR_408": 606,
    "VAR_657": 607,
    "VAR_679": 608,
    "VAR_682": 609,
    "VAR_683": 610,
    "VAR_684": 611,
    "VAR_416": 612,
    "VAR_546": 613,
    "VAR_588": 614,
    "VAR_407": 615,
    "VAR_438": 616,
    "VAR_502": 617,
    "VAR_512": 618,
    "VAR_584": 619,
    "VAR_587": 620,
    "VAR_622": 621,
    "VAR_689": 622,
    "VAR_746": 623,
    "VAR_763": 624,
    "VAR_970": 625,
    "VAR_434": 626,
    "VAR_445": 627,
    "VAR_498": 628,
    "VAR_517": 629,
    "VAR_674": 630,
    "VAR_712": 631,
    "VAR_732": 632,
    "VAR_897": 633,
    "VAR_966": 634,
    "VAR_444": 635,
    "VAR_457": 636,
    "VAR_485": 637,
    "VAR_520": 638,
    "VAR_544": 639,
    "VAR_578": 640,
    "VAR_687": 641,
    "VAR_972": 642,
    "VAR_440": 643,
    "VAR_501": 644,
    "VAR_574": 645,
    "VAR_625": 646,
    "VAR_660": 647,
    "VAR_669": 648,
    "VAR_672": 649,
    "VAR_716": 650,
    "VAR_439": 651,
    "VAR_481": 652,
    "VAR_487": 653,
    "VAR_513": 654,
    "VAR_527": 655,
    "VAR_533": 656,
    "VAR_547": 657,
    "VAR_579": 658,
    "VAR_595": 659,
    "VAR_596": 660,
    "VAR_710": 661,
    "VAR_836": 662,
    "VAR_881": 663,
    "VAR_890": 664,
    "VAR_459": 665,
    "VAR_526": 666,
    "VAR_550": 667,
    "VAR_627": 668,
    "VAR_724": 669,
    "VAR_740": 670,
    "VAR_765": 671,
    "VAR_410": 672,
    "VAR_432": 673,
    "VAR_470": 674,
    "VAR_499": 675,
    "VAR_515": 676,
    "VAR_529": 677,
    "VAR_580": 678,
    "VAR_644": 679,
    "VAR_709": 680,
    "VAR_717": 681,
    "VAR_767": 682,
    "VAR_782": 683,
    "VAR_882": 684,
    "VAR_451": 685,
    "VAR_456": 686,
    "VAR_465": 687,
    "VAR_518": 688,
    "VAR_525": 689,
    "VAR_565": 690,
    "VAR_589": 691,
    "VAR_638": 692,
    "VAR_646": 693,
    "VAR_647": 694,
    "VAR_658": 695,
    "VAR_663": 696,
    "VAR_668": 697,
    "VAR_704": 698,
    "VAR_715": 699,
    "VAR_944": 700,
    "VAR_441": 701,
    "VAR_449": 702,
    "VAR_482": 703,
    "VAR_505": 704,
    "VAR_561": 705,
    "VAR_586": 706,
    "VAR_605": 707,
    "VAR_637": 708,
    "VAR_639": 709,
    "VAR_650": 710,
    "VAR_664": 711,
    "VAR_671": 712,
    "VAR_675": 713,
    "VAR_699": 714,
    "VAR_729": 715,
    "VAR_839": 716,
    "VAR_853": 717,
    "VAR_489": 718,
    "VAR_535": 719,
    "VAR_536": 720,
    "VAR_552": 721,
    "VAR_557": 722,
    "VAR_583": 723,
    "VAR_590": 724,
    "VAR_593": 725,
    "VAR_614": 726,
    "VAR_700": 727,
    "VAR_728": 728,
    "VAR_458": 729,
    "VAR_464": 730,
    "VAR_474": 731,
    "VAR_475": 732,
    "VAR_476": 733,
    "VAR_490": 734,
    "VAR_500": 735,
    "VAR_564": 736,
    "VAR_567": 737,
    "VAR_621": 738,
    "VAR_624": 739,
    "VAR_626": 740,
    "VAR_727": 741,
    "VAR_730": 742,
    "VAR_731": 743,
    "VAR_753": 744,
    "VAR_779": 745,
    "VAR_786": 746,
    "VAR_837": 747,
    "VAR_889": 748,
    "VAR_471": 749,
    "VAR_483": 750,
    "VAR_496": 751,
    "VAR_582": 752,
    "VAR_619": 753,
    "VAR_685": 754,
    "VAR_686": 755,
    "VAR_733": 756,
    "VAR_747": 757,
    "VAR_766": 758,
    "VAR_823": 759,
    "VAR_833": 760,
    "VAR_834": 761,
    "VAR_838": 762,
    "VAR_899": 763,
    "VAR_462": 764,
    "VAR_463": 765,
    "VAR_484": 766,
    "VAR_488": 767,
    "VAR_491": 768,
    "VAR_497": 769,
    "VAR_548": 770,
    "VAR_551": 771,
    "VAR_558": 772,
    "VAR_563": 773,
    "VAR_618": 774,
    "VAR_635": 775,
    "VAR_665": 776,
    "VAR_723": 777,
    "VAR_764": 778,
    "VAR_852": 779,
    "VAR_854": 780,
    "VAR_964": 781,
    "VAR_467": 782,
    "VAR_506": 783,
    "VAR_511": 784,
    "VAR_514": 785,
    "VAR_555": 786,
    "VAR_600": 787,
    "VAR_602": 788,
    "VAR_633": 789,
    "VAR_721": 790,
    "VAR_726": 791,
    "VAR_743": 792,
    "VAR_762": 793,
    "VAR_785": 794,
    "VAR_861": 795,
    "VAR_982": 796,
    "VAR_493": 797,
    "VAR_510": 798,
    "VAR_556": 799,
    "VAR_629": 800,
    "VAR_634": 801,
    "VAR_636": 802,
    "VAR_641": 803,
    "VAR_651": 804,
    "VAR_661": 805,
    "VAR_667": 806,
    "VAR_690": 807,
    "VAR_693": 808,
    "VAR_698": 809,
    "VAR_725": 810,
    "VAR_768": 811,
    "VAR_519": 812,
    "VAR_559": 813,
    "VAR_560": 814,
    "VAR_566": 815,
    "VAR_601": 816,
    "VAR_642": 817,
    "VAR_643": 818,
    "VAR_653": 819,
    "VAR_666": 820,
    "VAR_677": 821,
    "VAR_701": 822,
    "VAR_707": 823,
    "VAR_737": 824,
    "VAR_741": 825,
    "VAR_742": 826,
    "VAR_780": 827,
    "VAR_781": 828,
    "VAR_784": 829,
    "VAR_819": 830,
    "VAR_828": 831,
    "VAR_607": 832,
    "VAR_630": 833,
    "VAR_695": 834,
    "VAR_706": 835,
    "VAR_719": 836,
    "VAR_750": 837,
    "VAR_775": 838,
    "VAR_816": 839,
    "VAR_829": 840,
    "VAR_851": 841,
    "VAR_855": 842,
    "VAR_901": 843,
    "VAR_904": 844,
    "VAR_943": 845,
    "VAR_632": 846,
    "VAR_645": 847,
    "VAR_652": 848,
    "VAR_656": 849,
    "VAR_735": 850,
    "VAR_739": 851,
    "VAR_749": 852,
    "VAR_776": 853,
    "VAR_788": 854,
    "VAR_818": 855,
    "VAR_846": 856,
    "`": 857,
    "VAR_631": 858,
    "VAR_640": 859,
    "VAR_649": 860,
    "VAR_654": 861,
    "VAR_662": 862,
    "VAR_688": 863,
    "VAR_692": 864,
    "VAR_738": 865,
    "VAR_752": 866,
    "VAR_771": 867,
    "VAR_789": 868,
    "VAR_696": 869,
    "VAR_697": 870,
    "VAR_757": 871,
    "VAR_761": 872,
    "VAR_805": 873,
    "VAR_827": 874,
    "VAR_850": 875,
    "VAR_856": 876,
    "VAR_751": 877,
    "VAR_754": 878,
    "VAR_777": 879,
    "VAR_799": 880,
    "VAR_803": 881,
    "VAR_806": 882,
    "VAR_821": 883,
    "VAR_831": 884,
    "VAR_844": 885,
    "VAR_860": 886,
    "VAR_862": 887,
    "VAR_1131": 888,
    "VAR_694": 889,
    "VAR_770": 890,
    "VAR_790": 891,
    "VAR_842": 892,
    "VAR_900": 893,
    "VAR_912": 894,
    "VAR_1000": 895,
    "VAR_1236": 896,
    "VAR_734": 897,
    "VAR_736": 898,
    "VAR_745": 899,
    "VAR_772": 900,
    "VAR_802": 901,
    "VAR_808": 902,
    "VAR_811": 903,
    "VAR_812": 904,
    "VAR_841": 905,
    "VAR_869": 906,
    "VAR_896": 907,
    "VAR_971": 908,
    "VAR_973": 909,
    "VAR_976": 910,
    "VAR_979": 911,
    "VAR_980": 912,
    "VAR_981": 913,
    "VAR_984": 914,
    "VAR_1117": 915,
    "VAR_705": 916,
    "VAR_755": 917,
    "VAR_756": 918,
    "VAR_758": 919,
    "VAR_759": 920,
    "VAR_769": 921,
    "VAR_773": 922,
    "VAR_787": 923,
    "VAR_801": 924,
    "VAR_807": 925,
    "VAR_813": 926,
    "VAR_835": 927,
    "VAR_859": 928,
    "VAR_880": 929,
    "VAR_898": 930,
    "VAR_975": 931,
    "VAR_983": 932,
    "VAR_992": 933,
    "VAR_1022": 934,
    "VAR_1054": 935,
    "VAR_1114": 936,
    "VAR_748": 937,
    "VAR_760": 938,
    "VAR_774": 939,
    "VAR_778": 940,
    "VAR_783": 941,
    "VAR_797": 942,
    "VAR_800": 943,
    "VAR_804": 944,
    "VAR_809": 945,
    "VAR_810": 946,
    "VAR_822": 947,
    "VAR_824": 948,
    "VAR_840": 949,
    "VAR_905": 950,
    "VAR_911": 951,
    "VAR_915": 952,
    "VAR_923": 953,
    "VAR_791": 954,
    "VAR_792": 955,
    "VAR_830": 956,
    "VAR_832": 957,
    "VAR_858": 958,
    "VAR_868": 959,
    "VAR_883": 960,
    "VAR_886": 961,
    "VAR_914": 962,
    "VAR_922": 963,
    "VAR_958": 964,
    "VAR_960": 965,
    "VAR_1128": 966,
    "VAR_1186": 967,
    "VAR_1189": 968,
    "VAR_793": 969,
    "VAR_795": 970,
    "VAR_796": 971,
    "VAR_798": 972,
    "VAR_814": 973,
    "VAR_815": 974,
    "VAR_820": 975,
    "VAR_848": 976,
    "VAR_857": 977,
    "VAR_864": 978,
    "VAR_884": 979,
    "VAR_903": 980,
    "VAR_916": 981,
    "VAR_928": 982,
    "extern": 983,
    "VAR_1118": 984,
    "VAR_1132": 985,
    "VAR_1176": 986,
    "VAR_794": 987,
    "VAR_817": 988,
    "VAR_825": 989,
    "VAR_826": 990,
    "VAR_865": 991,
    "VAR_870": 992,
    "VAR_891": 993,
    "VAR_892": 994,
    "VAR_918": 995,
    "VAR_924": 996,
    "VAR_937": 997,
    "VAR_949": 998,
    "VAR_952": 999,
    "VAR_953": 1000,
    "VAR_954": 1001,
    "VAR_1133": 1002,
    "VAR_863": 1003,
    "VAR_875": 1004,
    "VAR_879": 1005,
    "VAR_887": 1006,
    "VAR_902": 1007,
    "VAR_908": 1008,
    "VAR_913": 1009,
    "VAR_919": 1010,
    "VAR_941": 1011,
    "VAR_942": 1012,
    "VAR_955": 1013,
    "VAR_968": 1014,
    "VAR_1016": 1015,
    "VAR_1024": 1016,
    "VAR_1044": 1017,
    "VAR_1053": 1018,
    "VAR_1074": 1019,
    "VAR_1109": 1020,
    "VAR_1130": 1021,
    "VAR_1137": 1022,
    "VAR_1184": 1023,
    "VAR_849": 1024,
    "VAR_866": 1025,
    "VAR_867": 1026,
    "VAR_871": 1027,
    "VAR_872": 1028,
    "VAR_873": 1029,
    "VAR_876": 1030,
    "VAR_878": 1031,
    "VAR_885": 1032,
    "VAR_893": 1033,
    "VAR_895": 1034,
    "VAR_909": 1035,
    "VAR_917": 1036,
    "VAR_925": 1037,
    "VAR_929": 1038,
    "VAR_931": 1039,
    "VAR_933": 1040,
    "VAR_945": 1041,
    "VAR_946": 1042,
    "VAR_950": 1043,
    "VAR_951": 1044,
    "VAR_957": 1045,
    "VAR_989": 1046,
    "VAR_997": 1047,
    "VAR_1017": 1048,
    "VAR_1026": 1049,
    "VAR_1031": 1050,
    "VAR_1041": 1051,
    "VAR_1086": 1052,
    "VAR_1087": 1053,
    "VAR_1088": 1054,
    "VAR_1124": 1055,
    "VAR_1126": 1056,
    "VAR_1135": 1057,
    "VAR_1139": 1058,
    "VAR_1140": 1059,
    "VAR_1196": 1060,
    "VAR_874": 1061,
    "VAR_877": 1062,
    "VAR_888": 1063,
    "VAR_894": 1064,
    "VAR_906": 1065,
    "VAR_927": 1066,
    "VAR_930": 1067,
    "VAR_932": 1068,
    "VAR_935": 1069,
    "VAR_936": 1070,
    "VAR_938": 1071,
    "VAR_939": 1072,
    "VAR_940": 1073,
    "VAR_947": 1074,
    "VAR_948": 1075,
    "VAR_959": 1076,
    "VAR_961": 1077,
    "VAR_963": 1078,
    "VAR_1011": 1079,
    "VAR_1015": 1080,
    "VAR_1032": 1081,
    "VAR_1051": 1082,
    "VAR_1065": 1083,
    "VAR_1089": 1084,
    "VAR_1104": 1085,
    "VAR_1108": 1086,
    "VAR_1119": 1087,
    "VAR_1121": 1088,
    "VAR_1123": 1089,
    "VAR_1127": 1090,
    "VAR_1129": 1091,
    "VAR_1138": 1092,
    "VAR_1191": 1093,
    "VAR_1238": 1094,
    "VAR_907": 1095,
    "VAR_910": 1096,
    "VAR_920": 1097,
    "VAR_921": 1098,
    "VAR_926": 1099,
    "VAR_934": 1100,
    "VAR_956": 1101,
    "VAR_965": 1102,
    "VAR_977": 1103,
    "VAR_985": 1104,
    "VAR_990": 1105,
    "VAR_998": 1106,
    "VAR_1002": 1107,
    "VAR_1008": 1108,
    "VAR_1010": 1109,
    "VAR_1014": 1110,
    "VAR_1018": 1111,
    "VAR_1023": 1112,
    "VAR_1025": 1113,
    "VAR_1029": 1114,
    "VAR_1030": 1115,
    "VAR_1034": 1116,
    "VAR_1035": 1117,
    "VAR_1042": 1118,
    "VAR_1047": 1119,
    "VAR_1050": 1120,
    "VAR_1052": 1121,
    "VAR_1064": 1122,
    "VAR_1079": 1123,
    "VAR_1083": 1124,
    "VAR_1090": 1125,
    "VAR_1097": 1126,
    "VAR_1098": 1127,
    "VAR_1099": 1128,
    "VAR_1100": 1129,
    "VAR_1106": 1130,
    "VAR_1113": 1131,
    "VAR_1115": 1132,
    "VAR_1116": 1133,
    "VAR_1136": 1134,
    "VAR_1143": 1135,
    "VAR_1146": 1136,
    "VAR_1147": 1137,
    "VAR_1150": 1138,
    "VAR_1164": 1139,
    "VAR_1174": 1140,
    "VAR_1194": 1141,
    "VAR_969": 1142,
    "VAR_978": 1143,
    "VAR_986": 1144,
    "VAR_993": 1145,
    "VAR_994": 1146,
    "VAR_999": 1147,
    "VAR_1001": 1148,
    "VAR_1003": 1149,
    "VAR_1004": 1150,
    "VAR_1005": 1151,
    "VAR_1006": 1152,
    "VAR_1007": 1153,
    "VAR_1012": 1154,
    "VAR_1020": 1155,
    "VAR_1028": 1156,
    "VAR_1037": 1157,
    "VAR_1038": 1158,
    "VAR_1039": 1159,
    "VAR_1043": 1160,
    "VAR_1046": 1161,
    "VAR_1048": 1162,
    "VAR_1049": 1163,
    "VAR_1055": 1164,
    "VAR_1056": 1165,
    "VAR_1058": 1166,
    "VAR_1059": 1167,
    "VAR_1066": 1168,
    "VAR_1068": 1169,
    "VAR_1070": 1170,
    "VAR_1071": 1171,
    "VAR_1073": 1172,
    "VAR_1078": 1173,
    "VAR_1091": 1174,
    "VAR_1093": 1175,
    "VAR_1096": 1176,
    "VAR_1105": 1177,
    "VAR_1107": 1178,
    "VAR_1125": 1179,
    "VAR_1142": 1180,
    "VAR_1149": 1181,
    "VAR_1151": 1182,
    "VAR_1152": 1183,
    "VAR_1155": 1184,
    "VAR_1156": 1185,
    "VAR_1163": 1186,
    "VAR_1165": 1187,
    "VAR_1167": 1188,
    "VAR_1169": 1189,
    "VAR_1173": 1190,
    "VAR_1185": 1191,
    "VAR_1187": 1192,
    "VAR_1190": 1193,
    "VAR_1193": 1194,
    "VAR_1229": 1195,
    "VAR_967": 1196,
    "VAR_987": 1197,
    "VAR_988": 1198,
    "VAR_991": 1199,
    "VAR_995": 1200,
    "VAR_996": 1201,
    "VAR_1009": 1202,
    "VAR_1013": 1203,
    "VAR_1019": 1204,
    "VAR_1021": 1205,
    "VAR_1027": 1206,
    "VAR_1033": 1207,
    "VAR_1036": 1208,
    "VAR_1040": 1209,
    "VAR_1045": 1210,
    "VAR_1057": 1211,
    "VAR_1060": 1212,
    "VAR_1061": 1213,
    "VAR_1063": 1214,
    "VAR_1067": 1215,
    "VAR_1069": 1216,
    "VAR_1072": 1217,
    "VAR_1075": 1218,
    "VAR_1076": 1219,
    "VAR_1084": 1220,
    "VAR_1085": 1221,
    "VAR_1092": 1222,
    "VAR_1094": 1223,
    "VAR_1095": 1224,
    "VAR_1101": 1225,
    "VAR_1102": 1226,
    "VAR_1103": 1227,
    "VAR_1110": 1228,
    "VAR_1111": 1229,
    "VAR_1112": 1230,
    "VAR_1154": 1231,
    "VAR_1161": 1232,
    "VAR_1162": 1233,
    "VAR_1171": 1234,
    "VAR_1175": 1235,
    "VAR_1183": 1236,
    "VAR_1188": 1237,
    "VAR_1203": 1238,
    "VAR_1204": 1239,
    "VAR_1227": 1240,
    "VAR_1234": 1241,
    "VAR_1077": 1242,
    "VAR_1080": 1243,
    "VAR_1081": 1244,
    "VAR_1082": 1245,
    "VAR_1120": 1246,
    "VAR_1122": 1247,
    "VAR_1134": 1248,
    "VAR_1141": 1249,
    "VAR_1144": 1250,
    "VAR_1148": 1251,
    "VAR_1157": 1252,
    "VAR_1160": 1253,
    "VAR_1170": 1254,
    "VAR_1177": 1255,
    "VAR_1192": 1256,
    "VAR_1195": 1257,
    "VAR_1197": 1258,
    "VAR_1206": 1259,
    "VAR_1207": 1260,
    "VAR_1213": 1261,
    "VAR_1222": 1262,
    "VAR_1224": 1263,
    "VAR_1237": 1264,
    "VAR_1239": 1265,
    "VAR_1244": 1266,
    "VAR_1261": 1267,
    "typedef": 1268,
    "VAR_1145": 1269,
    "VAR_1158": 1270,
    "VAR_1159": 1271,
    "VAR_1166": 1272,
    "VAR_1172": 1273,
    "VAR_1178": 1274,
    "VAR_1179": 1275,
    "VAR_1181": 1276,
    "VAR_1182": 1277,
    "VAR_1199": 1278,
    "VAR_1200": 1279,
    "VAR_1201": 1280,
    "VAR_1208": 1281,
    "VAR_1228": 1282,
    "VAR_1240": 1283,
    "VAR_1241": 1284,
    "VAR_1246": 1285,
    "VAR_1253": 1286,
    "VAR_1256": 1287,
    "VAR_1259": 1288,
    "VAR_1260": 1289,
    "VAR_1168": 1290,
    "VAR_1180": 1291,
    "VAR_1198": 1292,
    "VAR_1210": 1293,
    "VAR_1212": 1294,
    "VAR_1218": 1295,
    "VAR_1219": 1296,
    "VAR_1221": 1297,
    "VAR_1223": 1298,
    "VAR_1235": 1299,
    "VAR_1242": 1300,
    "VAR_1245": 1301,
    "VAR_1248": 1302,
    "VAR_1250": 1303,
    "VAR_1252": 1304,
    "VAR_1255": 1305,
    "VAR_1258": 1306,
    "VAR_1263": 1307,
    "VAR_1266": 1308,
    "VAR_1269": 1309,
    "VAR_1270": 1310,
    "VAR_1272": 1311
  },
  "id2token": [
    "<PAD>",
    "<UNK>",
    "<BOS>",
    "<EOS>",
    ";",
    "(",
    ")",
    ",",
    "-",
    "=",
    "NUM",
    ">",
    "VAR_2",
    "\"",
    "{",
    "}",
    "[",
    "]",
    "*",
    "&",
    "if",
    "VAR_4",
    "+",
    "VAR_6",
    "VAR_5",
    "VAR_3",
    "VAR_7",
    "VAR_8",
    "VAR_9",
    ".",
    "VAR_10",
    "VAR_12",
    ":",
    "VAR_11",
    "%",
    "<",
    "VAR_13",
    "VAR_14",
    "VAR_15",
    "\\",
    "VAR_16",
    "VAR_17",
    "int",
    "VAR_18",
    "VAR_19",
    "VAR_20",
    "!",
    "VAR_21",
    "return",
    "case",
    "|",
    "VAR_22",
    "VAR_23",
    "VAR_24",
    "VAR_25",
    "break",
    "VAR_1",
    "VAR_26",
    "else",
    "VAR_27",
    "VAR_28",
    "VAR_29",
    "VAR_0",
    "VAR_31",
    "VAR_30",
    "VAR_32",
    "#",
    "VAR_33",
    "VAR_34",
    "VAR_35",
    "for",
    "'",
    "VAR_36",
    "VAR_37",
    "NULL",
    "VAR_39",
    "VAR_38",
    "VAR_41",
    "VAR_40",
    "static",
    "void",
    "VAR_43",
    "VAR_42",
    "VAR_44",
    "VAR_45",
    "VAR_46",
    "const",
    "goto",
    "VAR_48",
    "VAR_47",
    "VAR_49",
    "VAR_51",
    "sizeof",
    "VAR_50",
    "VAR_52",
    "VAR_53",
    "VAR_55",
    "VAR_54",
    "/",
    "VAR_57",
    "VAR_58",
    "VAR_56",
    "VAR_59",
    "char",
    "VAR_60",
    "VAR_62",
    "VAR_61",
    "VAR_63",
    "VAR_65",
    "VAR_66",
    "?",
    "VAR_64",
    "VAR_69",
    "VAR_67",
    "VAR_70",
    "VAR_68",
    "VAR_71",
    "VAR_74",
    "VAR_72",
    "VAR_75",
    "VAR_76",
    "VAR_73",
    "unsigned",
    "switch",
    "VAR_77",
    "struct",
    "VAR_78",
    "VAR_79",
    "VAR_80",
    "VAR_81",
    "VAR_82",
    "VAR_83",
    "VAR_84",
    "VAR_85",
    "VAR_92",
    "VAR_86",
    "VAR_88",
    "VAR_87",
    "while",
    "VAR_90",
    "VAR_89",
    "VAR_91",
    "VAR_93",
    "VAR_94",
    "VAR_98",
    "~",
    "VAR_95",
    "VAR_99",
    "VAR_96",
    "VAR_97",
    "VAR_101",
    "VAR_100",
    "VAR_102",
    "VAR_112",
    "VAR_104",
    "VAR_103",
    "VAR_111",
    "VAR_107",
    "VAR_110",
    "VAR_106",
    "VAR_105",
    "VAR_109",
    "VAR_113",
    "VAR_108",
    "true",
    "VAR_114",
    "VAR_117",
    "VAR_119",
    "VAR_127",
    "false",
    "VAR_116",
    "VAR_125",
    "VAR_115",
    "continue",
    "VAR_121",
    "VAR_124",
    "VAR_120",
    "VAR_118",
    "VAR_128",
    "float",
    "VAR_126",
    "VAR_123",
    "$",
    "VAR_122",
    "long",
    "VAR_129",
    "VAR_130",
    "VAR_132",
    "VAR_131",
    "VAR_135",
    "VAR_133",
    "VAR_147",
    "VAR_134",
    "VAR_144",
    "VAR_138",
    "VAR_136",
    "VAR_148",
    "VAR_142",
    "VAR_137",
    "VAR_140",
    "^",
    "VAR_145",
    "VAR_149",
    "VAR_139",
    "VAR_152",
    "VAR_157",
    "VAR_158",
    "VAR_143",
    "VAR_141",
    "VAR_150",
    "VAR_146",
    "double",
    "VAR_160",
    "VAR_151",
    "VAR_163",
    "VAR_153",
    "VAR_168",
    "VAR_165",
    "VAR_164",
    "VAR_155",
    "VAR_156",
    "VAR_154",
    "VAR_159",
    "VAR_169",
    "VAR_184",
    "VAR_161",
    "VAR_162",
    "VAR_187",
    "VAR_167",
    "VAR_192",
    "VAR_182",
    "VAR_171",
    "VAR_174",
    "VAR_178",
    "VAR_172",
    "VAR_166",
    "VAR_189",
    "VAR_170",
    "VAR_179",
    "VAR_176",
    "VAR_191",
    "VAR_173",
    "short",
    "VAR_180",
    "VAR_177",
    "VAR_188",
    "VAR_186",
    "VAR_205",
    "VAR_175",
    "VAR_181",
    "VAR_190",
    "VAR_196",
    "VAR_183",
    "VAR_194",
    "enum",
    "VAR_185",
    "VAR_193",
    "VAR_198",
    "VAR_197",
    "VAR_195",
    "VAR_202",
    "VAR_199",
    "VAR_201",
    "VAR_203",
    "VAR_200",
    "VAR_204",
    "VAR_212",
    "VAR_224",
    "VAR_206",
    "VAR_211",
    "VAR_220",
    "VAR_207",
    "VAR_228",
    "signed",
    "VAR_215",
    "VAR_229",
    "VAR_233",
    "VAR_209",
    "VAR_225",
    "VAR_226",
    "VAR_213",
    "VAR_234",
    "VAR_208",
    "VAR_210",
    "VAR_214",
    "VAR_216",
    "VAR_270",
    "VAR_227",
    "VAR_221",
    "VAR_230",
    "VAR_218",
    "VAR_222",
    "VAR_236",
    "VAR_266",
    "VAR_217",
    "VAR_219",
    "VAR_223",
    "VAR_231",
    "VAR_235",
    "VAR_239",
    "VAR_272",
    "VAR_232",
    "VAR_241",
    "VAR_258",
    "VAR_240",
    "VAR_273",
    "VAR_260",
    "VAR_237",
    "VAR_261",
    "VAR_263",
    "VAR_274",
    "VAR_269",
    "VAR_286",
    "VAR_265",
    "VAR_278",
    "VAR_275",
    "VAR_248",
    "VAR_303",
    "VAR_268",
    "VAR_277",
    "VAR_238",
    "VAR_244",
    "VAR_366",
    "VAR_250",
    "VAR_271",
    "VAR_253",
    "@",
    "VAR_291",
    "VAR_242",
    "VAR_284",
    "VAR_267",
    "VAR_294",
    "VAR_254",
    "VAR_298",
    "VAR_255",
    "VAR_247",
    "VAR_282",
    "VAR_309",
    "VAR_243",
    "VAR_317",
    "VAR_365",
    "VAR_251",
    "VAR_249",
    "VAR_262",
    "VAR_256",
    "VAR_246",
    "VAR_285",
    "VAR_252",
    "VAR_279",
    "VAR_305",
    "VAR_245",
    "VAR_283",
    "VAR_301",
    "VAR_300",
    "VAR_307",
    "VAR_308",
    "VAR_276",
    "VAR_299",
    "VAR_296",
    "VAR_259",
    "VAR_304",
    "VAR_313",
    "VAR_257",
    "VAR_293",
    "VAR_280",
    "VAR_281",
    "VAR_297",
    "VAR_332",
    "VAR_295",
    "VAR_264",
    "VAR_287",
    "VAR_302",
    "VAR_310",
    "VAR_306",
    "VAR_315",
    "VAR_362",
    "VAR_292",
    "VAR_288",
    "VAR_289",
    "VAR_290",
    "VAR_316",
    "VAR_312",
    "VAR_357",
    "VAR_343",
    "VAR_374",
    "VAR_337",
    "VAR_326",
    "VAR_356",
    "VAR_321",
    "VAR_364",
    "VAR_370",
    "VAR_314",
    "VAR_369",
    "VAR_324",
    "VAR_333",
    "VAR_311",
    "VAR_341",
    "VAR_358",
    "VAR_367",
    "VAR_376",
    "VAR_320",
    "VAR_346",
    "VAR_385",
    "VAR_330",
    "VAR_718",
    "VAR_329",
    "VAR_348",
    "VAR_353",
    "VAR_419",
    "VAR_319",
    "VAR_327",
    "VAR_373",
    "VAR_603",
    "VAR_322",
    "VAR_318",
    "VAR_350",
    "VAR_415",
    "VAR_452",
    "VAR_336",
    "VAR_372",
    "VAR_711",
    "VAR_328",
    "VAR_472",
    "VAR_349",
    "VAR_382",
    "VAR_446",
    "VAR_477",
    "VAR_347",
    "VAR_354",
    "VAR_359",
    "VAR_325",
    "VAR_323",
    "VAR_361",
    "VAR_363",
    "VAR_609",
    "VAR_345",
    "VAR_377",
    "VAR_420",
    "VAR_355",
    "VAR_360",
    "VAR_334",
    "VAR_368",
    "VAR_344",
    "VAR_335",
    "VAR_585",
    "VAR_352",
    "VAR_378",
    "VAR_331",
    "VAR_342",
    "VAR_339",
    "VAR_340",
    "VAR_486",
    "VAR_418",
    "VAR_541",
    "VAR_400",
    "VAR_495",
    "VAR_375",
    "VAR_381",
    "VAR_426",
    "VAR_351",
    "VAR_478",
    "VAR_379",
    "VAR_386",
    "VAR_454",
    "VAR_524",
    "VAR_591",
    "VAR_744",
    "VAR_390",
    "VAR_387",
    "VAR_413",
    "VAR_611",
    "VAR_394",
    "VAR_399",
    "VAR_598",
    "VAR_371",
    "VAR_384",
    "VAR_469",
    "VAR_338",
    "VAR_380",
    "VAR_422",
    "VAR_395",
    "VAR_412",
    "VAR_538",
    "VAR_616",
    "VAR_388",
    "VAR_383",
    "VAR_507",
    "VAR_401",
    "VAR_428",
    "VAR_613",
    "VAR_575",
    "VAR_606",
    "VAR_443",
    "VAR_594",
    "VAR_396",
    "VAR_473",
    "VAR_562",
    "VAR_405",
    "VAR_479",
    "VAR_676",
    "VAR_453",
    "VAR_468",
    "VAR_508",
    "VAR_531",
    "VAR_542",
    "VAR_554",
    "VAR_576",
    "VAR_389",
    "VAR_494",
    "VAR_577",
    "VAR_392",
    "VAR_393",
    "VAR_402",
    "VAR_612",
    "VAR_572",
    "VAR_678",
    "VAR_720",
    "VAR_423",
    "VAR_424",
    "VAR_480",
    "VAR_680",
    "VAR_845",
    "VAR_404",
    "VAR_528",
    "VAR_543",
    "VAR_545",
    "VAR_569",
    "VAR_648",
    "VAR_398",
    "VAR_455",
    "VAR_530",
    "VAR_391",
    "VAR_409",
    "VAR_414",
    "VAR_421",
    "VAR_431",
    "VAR_534",
    "VAR_581",
    "VAR_433",
    "VAR_447",
    "VAR_466",
    "VAR_573",
    "VAR_604",
    "VAR_670",
    "VAR_708",
    "VAR_522",
    "VAR_599",
    "union",
    "VAR_406",
    "VAR_539",
    "VAR_549",
    "VAR_553",
    "VAR_597",
    "VAR_722",
    "VAR_411",
    "VAR_537",
    "VAR_608",
    "VAR_713",
    "VAR_417",
    "VAR_430",
    "VAR_450",
    "VAR_532",
    "VAR_610",
    "VAR_620",
    "VAR_673",
    "VAR_714",
    "VAR_521",
    "VAR_568",
    "VAR_1153",
    "VAR_516",
    "VAR_592",
    "VAR_702",
    "VAR_403",
    "VAR_425",
    "VAR_448",
    "VAR_461",
    "VAR_492",
    "VAR_504",
    "VAR_540",
    "VAR_570",
    "VAR_571",
    "VAR_847",
    "VAR_1062",
    "VAR_429",
    "VAR_436",
    "VAR_437",
    "VAR_442",
    "VAR_460",
    "VAR_523",
    "VAR_617",
    "VAR_623",
    "VAR_843",
    "VAR_397",
    "VAR_427",
    "VAR_435",
    "VAR_509",
    "VAR_615",
    "VAR_655",
    "VAR_681",
    "VAR_691",
    "VAR_703",
    "VAR_974",
    "VAR_503",
    "VAR_628",
    "VAR_659",
    "VAR_962",
    "VAR_408",
    "VAR_657",
    "VAR_679",
    "VAR_682",
    "VAR_683",
    "VAR_684",
    "VAR_416",
    "VAR_546",
    "VAR_588",
    "VAR_407",
    "VAR_438",
    "VAR_502",
    "VAR_512",
    "VAR_584",
    "VAR_587",
    "VAR_622",
    "VAR_689",
    "VAR_746",
    "VAR_763",
    "VAR_970",
    "VAR_434",
    "VAR_445",
    "VAR_498",
    "VAR_517",
    "VAR_674",
    "VAR_712",
    "VAR_732",
    "VAR_897",
    "VAR_966",
    "VAR_444",
    "VAR_457",
    "VAR_485",
    "VAR_520",
    "VAR_544",
    "VAR_578",
    "VAR_687",
    "VAR_972",
    "VAR_440",
    "VAR_501",
    "VAR_574",
    "VAR_625",
    "VAR_660",
    "VAR_669",
    "VAR_672",
    "VAR_716",
    "VAR_439",
    "VAR_481",
    "VAR_487",
    "VAR_513",
    "VAR_527",
    "VAR_533",
    "VAR_547",
    "VAR_579",
    "VAR_595",
    "VAR_596",
    "VAR_710",
    "VAR_836",
    "VAR_881",
    "VAR_890",
    "VAR_459",
    "VAR_526",
    "VAR_550",
    "VAR_627",
    "VAR_724",
    "VAR_740",
    "VAR_765",
    "VAR_410",
    "VAR_432",
    "VAR_470",
    "VAR_499",
    "VAR_515",
    "VAR_529",
    "VAR_580",
    "VAR_644",
    "VAR_709",
    "VAR_717",
    "VAR_767",
    "VAR_782",
    "VAR_882",
    "VAR_451",
    "VAR_456",
    "VAR_465",
    "VAR_518",
    "VAR_525",
    "VAR_565",
    "VAR_589",
    "VAR_638",
    "VAR_646",
    "VAR_647",
    "VAR_658",
    "VAR_663",
    "VAR_668",
    "VAR_704",
    "VAR_715",
    "VAR_944",
    "VAR_441",
    "VAR_449",
    "VAR_482",
    "VAR_505",
    "VAR_561",
    "VAR_586",
    "VAR_605",
    "VAR_637",
    "VAR_639",
    "VAR_650",
    "VAR_664",
    "VAR_671",
    "VAR_675",
    "VAR_699",
    "VAR_729",
    "VAR_839",
    "VAR_853",
    "VAR_489",
    "VAR_535",
    "VAR_536",
    "VAR_552",
    "VAR_557",
    "VAR_583",
    "VAR_590",
    "VAR_593",
    "VAR_614",
    "VAR_700",
    "VAR_728",
    "VAR_458",
    "VAR_464",
    "VAR_474",
    "VAR_475",
    "VAR_476",
    "VAR_490",
    "VAR_500",
    "VAR_564",
    "VAR_567",
    "VAR_621",
    "VAR_624",
    "VAR_626",
    "VAR_727",
    "VAR_730",
    "VAR_731",
    "VAR_753",
    "VAR_779",
    "VAR_786",
    "VAR_837",
    "VAR_889",
    "VAR_471",
    "VAR_483",
    "VAR_496",
    "VAR_582",
    "VAR_619",
    "VAR_685",
    "VAR_686",
    "VAR_733",
    "VAR_747",
    "VAR_766",
    "VAR_823",
    "VAR_833",
    "VAR_834",
    "VAR_838",
    "VAR_899",
    "VAR_462",
    "VAR_463",
    "VAR_484",
    "VAR_488",
    "VAR_491",
    "VAR_497",
    "VAR_548",
    "VAR_551",
    "VAR_558",
    "VAR_563",
    "VAR_618",
    "VAR_635",
    "VAR_665",
    "VAR_723",
    "VAR_764",
    "VAR_852",
    "VAR_854",
    "VAR_964",
    "VAR_467",
    "VAR_506",
    "VAR_511",
    "VAR_514",
    "VAR_555",
    "VAR_600",
    "VAR_602",
    "VAR_633",
    "VAR_721",
    "VAR_726",
    "VAR_743",
    "VAR_762",
    "VAR_785",
    "VAR_861",
    "VAR_982",
    "VAR_493",
    "VAR_510",
    "VAR_556",
    "VAR_629",
    "VAR_634",
    "VAR_636",
    "VAR_641",
    "VAR_651",
    "VAR_661",
    "VAR_667",
    "VAR_690",
    "VAR_693",
    "VAR_698",
    "VAR_725",
    "VAR_768",
    "VAR_519",
    "VAR_559",
    "VAR_560",
    "VAR_566",
    "VAR_601",
    "VAR_642",
    "VAR_643",
    "VAR_653",
    "VAR_666",
    "VAR_677",
    "VAR_701",
    "VAR_707",
    "VAR_737",
    "VAR_741",
    "VAR_742",
    "VAR_780",
    "VAR_781",
    "VAR_784",
    "VAR_819",
    "VAR_828",
    "VAR_607",
    "VAR_630",
    "VAR_695",
    "VAR_706",
    "VAR_719",
    "VAR_750",
    "VAR_775",
    "VAR_816",
    "VAR_829",
    "VAR_851",
    "VAR_855",
    "VAR_901",
    "VAR_904",
    "VAR_943",
    "VAR_632",
    "VAR_645",
    "VAR_652",
    "VAR_656",
    "VAR_735",
    "VAR_739",
    "VAR_749",
    "VAR_776",
    "VAR_788",
    "VAR_818",
    "VAR_846",
    "`",
    "VAR_631",
    "VAR_640",
    "VAR_649",
    "VAR_654",
    "VAR_662",
    "VAR_688",
    "VAR_692",
    "VAR_738",
    "VAR_752",
    "VAR_771",
    "VAR_789",
    "VAR_696",
    "VAR_697",
    "VAR_757",
    "VAR_761",
    "VAR_805",
    "VAR_827",
    "VAR_850",
    "VAR_856",
    "VAR_751",
    "VAR_754",
    "VAR_777",
    "VAR_799",
    "VAR_803",
    "VAR_806",
    "VAR_821",
    "VAR_831",
    "VAR_844",
    "VAR_860",
    "VAR_862",
    "VAR_1131",
    "VAR_694",
    "VAR_770",
    "VAR_790",
    "VAR_842",
    "VAR_900",
    "VAR_912",
    "VAR_1000",
    "VAR_1236",
    "VAR_734",
    "VAR_736",
    "VAR_745",
    "VAR_772",
    "VAR_802",
    "VAR_808",
    "VAR_811",
    "VAR_812",
    "VAR_841",
    "VAR_869",
    "VAR_896",
    "VAR_971",
    "VAR_973",
    "VAR_976",
    "VAR_979",
    "VAR_980",
    "VAR_981",
    "VAR_984",
    "VAR_1117",
    "VAR_705",
    "VAR_755",
    "VAR_756",
    "VAR_758",
    "VAR_759",
    "VAR_769",
    "VAR_773",
    "VAR_787",
    "VAR_801",
    "VAR_807",
    "VAR_813",
    "VAR_835",
    "VAR_859",
    "VAR_880",
    "VAR_898",
    "VAR_975",
    "VAR_983",
    "VAR_992",
    "VAR_1022",
    "VAR_1054",
    "VAR_1114",
    "VAR_748",
    "VAR_760",
    "VAR_774",
    "VAR_778",
    "VAR_783",
    "VAR_797",
    "VAR_800",
    "VAR_804",
    "VAR_809",
    "VAR_810",
    "VAR_822",
    "VAR_824",
    "VAR_840",
    "VAR_905",
    "VAR_911",
    "VAR_915",
    "VAR_923",
    "VAR_791",
    "VAR_792",
    "VAR_830",
    "VAR_832",
    "VAR_858",
    "VAR_868",
    "VAR_883",
    "VAR_886",
    "VAR_914",
    "VAR_922",
    "VAR_958",
    "VAR_960",
    "VAR_1128",
    "VAR_1186",
    "VAR_1189",
    "VAR_793",
    "VAR_795",
    "VAR_796",
    "VAR_798",
    "VAR_814",
    "VAR_815",
    "VAR_820",
    "VAR_848",
    "VAR_857",
    "VAR_864",
    "VAR_884",
    "VAR_903",
    "VAR_916",
    "VAR_928",
    "extern",
    "VAR_1118",
    "VAR_1132",
    "VAR_1176",
    "VAR_794",
    "VAR_817",
    "VAR_825",
    "VAR_826",
    "VAR_865",
    "VAR_870",
    "VAR_891",
    "VAR_892",
    "VAR_918",
    "VAR_924",
    "VAR_937",
    "VAR_949",
    "VAR_952",
    "VAR_953",
    "VAR_954",
    "VAR_1133",
    "VAR_863",
    "VAR_875",
    "VAR_879",
    "VAR_887",
    "VAR_902",
    "VAR_908",
    "VAR_913",
    "VAR_919",
    "VAR_941",
    "VAR_942",
    "VAR_955",
    "VAR_968",
    "VAR_1016",
    "VAR_1024",
    "VAR_1044",
    "VAR_1053",
    "VAR_1074",
    "VAR_1109",
    "VAR_1130",
    "VAR_1137",
    "VAR_1184",
    "VAR_849",
    "VAR_866",
    "VAR_867",
    "VAR_871",
    "VAR_872",
    "VAR_873",
    "VAR_876",
    "VAR_878",
    "VAR_885",
    "VAR_893",
    "VAR_895",
    "VAR_909",
    "VAR_917",
    "VAR_925",
    "VAR_929",
    "VAR_931",
    "VAR_933",
    "VAR_945",
    "VAR_946",
    "VAR_950",
    "VAR_951",
    "VAR_957",
    "VAR_989",
    "VAR_997",
    "VAR_1017",
    "VAR_1026",
    "VAR_1031",
    "VAR_1041",
    "VAR_1086",
    "VAR_1087",
    "VAR_1088",
    "VAR_1124",
    "VAR_1126",
    "VAR_1135",
    "VAR_1139",
    "VAR_1140",
    "VAR_1196",
    "VAR_874",
    "VAR_877",
    "VAR_888",
    "VAR_894",
    "VAR_906",
    "VAR_927",
    "VAR_930",
    "VAR_932",
    "VAR_935",
    "VAR_936",
    "VAR_938",
    "VAR_939",
    "VAR_940",
    "VAR_947",
    "VAR_948",
    "VAR_959",
    "VAR_961",
    "VAR_963",
    "VAR_1011",
    "VAR_1015",
    "VAR_1032",
    "VAR_1051",
    "VAR_1065",
    "VAR_1089",
    "VAR_1104",
    "VAR_1108",
    "VAR_1119",
    "VAR_1121",
    "VAR_1123",
    "VAR_1127",
    "VAR_1129",
    "VAR_1138",
    "VAR_1191",
    "VAR_1238",
    "VAR_907",
    "VAR_910",
    "VAR_920",
    "VAR_921",
    "VAR_926",
    "VAR_934",
    "VAR_956",
    "VAR_965",
    "VAR_977",
    "VAR_985",
    "VAR_990",
    "VAR_998",
    "VAR_1002",
    "VAR_1008",
    "VAR_1010",
    "VAR_1014",
    "VAR_1018",
    "VAR_1023",
    "VAR_1025",
    "VAR_1029",
    "VAR_1030",
    "VAR_1034",
    "VAR_1035",
    "VAR_1042",
    "VAR_1047",
    "VAR_1050",
    "VAR_1052",
    "VAR_1064",
    "VAR_1079",
    "VAR_1083",
    "VAR_1090",
    "VAR_1097",
    "VAR_1098",
    "VAR_1099",
    "VAR_1100",
    "VAR_1106",
    "VAR_1113",
    "VAR_1115",
    "VAR_1116",
    "VAR_1136",
    "VAR_1143",
    "VAR_1146",
    "VAR_1147",
    "VAR_1150",
    "VAR_1164",
    "VAR_1174",
    "VAR_1194",
    "VAR_969",
    "VAR_978",
    "VAR_986",
    "VAR_993",
    "VAR_994",
    "VAR_999",
    "VAR_1001",
    "VAR_1003",
    "VAR_1004",
    "VAR_1005",
    "VAR_1006",
    "VAR_1007",
    "VAR_1012",
    "VAR_1020",
    "VAR_1028",
    "VAR_1037",
    "VAR_1038",
    "VAR_1039",
    "VAR_1043",
    "VAR_1046",
    "VAR_1048",
    "VAR_1049",
    "VAR_1055",
    "VAR_1056",
    "VAR_1058",
    "VAR_1059",
    "VAR_1066",
    "VAR_1068",
    "VAR_1070",
    "VAR_1071",
    "VAR_1073",
    "VAR_1078",
    "VAR_1091",
    "VAR_1093",
    "VAR_1096",
    "VAR_1105",
    "VAR_1107",
    "VAR_1125",
    "VAR_1142",
    "VAR_1149",
    "VAR_1151",
    "VAR_1152",
    "VAR_1155",
    "VAR_1156",
    "VAR_1163",
    "VAR_1165",
    "VAR_1167",
    "VAR_1169",
    "VAR_1173",
    "VAR_1185",
    "VAR_1187",
    "VAR_1190",
    "VAR_1193",
    "VAR_1229",
    "VAR_967",
    "VAR_987",
    "VAR_988",
    "VAR_991",
    "VAR_995",
    "VAR_996",
    "VAR_1009",
    "VAR_1013",
    "VAR_1019",
    "VAR_1021",
    "VAR_1027",
    "VAR_1033",
    "VAR_1036",
    "VAR_1040",
    "VAR_1045",
    "VAR_1057",
    "VAR_1060",
    "VAR_1061",
    "VAR_1063",
    "VAR_1067",
    "VAR_1069",
    "VAR_1072",
    "VAR_1075",
    "VAR_1076",
    "VAR_1084",
    "VAR_1085",
    "VAR_1092",
    "VAR_1094",
    "VAR_1095",
    "VAR_1101",
    "VAR_1102",
    "VAR_1103",
    "VAR_1110",
    "VAR_1111",
    "VAR_1112",
    "VAR_1154",
    "VAR_1161",
    "VAR_1162",
    "VAR_1171",
    "VAR_1175",
    "VAR_1183",
    "VAR_1188",
    "VAR_1203",
    "VAR_1204",
    "VAR_1227",
    "VAR_1234",
    "VAR_1077",
    "VAR_1080",
    "VAR_1081",
    "VAR_1082",
    "VAR_1120",
    "VAR_1122",
    "VAR_1134",
    "VAR_1141",
    "VAR_1144",
    "VAR_1148",
    "VAR_1157",
    "VAR_1160",
    "VAR_1170",
    "VAR_1177",
    "VAR_1192",
    "VAR_1195",
    "VAR_1197",
    "VAR_1206",
    "VAR_1207",
    "VAR_1213",
    "VAR_1222",
    "VAR_1224",
    "VAR_1237",
    "VAR_1239",
    "VAR_1244",
    "VAR_1261",
    "typedef",
    "VAR_1145",
    "VAR_1158",
    "VAR_1159",
    "VAR_1166",
    "VAR_1172",
    "VAR_1178",
    "VAR_1179",
    "VAR_1181",
    "VAR_1182",
    "VAR_1199",
    "VAR_1200",
    "VAR_1201",
    "VAR_1208",
    "VAR_1228",
    "VAR_1240",
    "VAR_1241",
    "VAR_1246",
    "VAR_1253",
    "VAR_1256",
    "VAR_1259",
    "VAR_1260",
    "VAR_1168",
    "VAR_1180",
    "VAR_1198",
    "VAR_1210",
    "VAR_1212",
    "VAR_1218",
    "VAR_1219",
    "VAR_1221",
    "VAR_1223",
    "VAR_1235",
    "VAR_1242",
    "VAR_1245",
    "VAR_1248",
    "VAR_1250",
    "VAR_1252",
    "VAR_1255",
    "VAR_1258",
    "VAR_1263",
    "VAR_1266",
    "VAR_1269",
    "VAR_1270",
    "VAR_1272"
  ],
  "token_freqs": {
    "<PAD>": 0,
    "<UNK>": 0,
    "<BOS>": 0,
    "<EOS>": 0,
    ";": 617437,
    "(": 576514,
    ")": 576470,
    ",": 486557,
    "-": 410037,
    "=": 408572,
    "NUM": 407483,
    ">": 399199,
    "VAR_2": 175441,
    "\"": 157344,
    "{": 151179,
    "}": 145828,
    "[": 145659,
    "]": 145637,
    "*": 140357,
    "&": 134664,
    "if": 121996,
    "VAR_4": 120845,
    "+": 116852,
    "VAR_6": 99441,
    "VAR_5": 95939,
    "VAR_3": 93827,
    "VAR_7": 90888,
    "VAR_8": 89845,
    "VAR_9": 88838,
    ".": 77549,
    "VAR_10": 76510,
    "VAR_12": 72450,
    ":": 72082,
    "VAR_11": 72059,
    "%": 71453,
    "<": 67369,
    "VAR_13": 65278,
    "VAR_14": 60191,
    "VAR_15": 60174,
    "\\": 56442,
    "VAR_16": 54843,
    "VAR_17": 54719,
    "int": 54585,
    "VAR_18": 50581,
    "VAR_19": 47716,
    "VAR_20": 45707,
    "!": 44210,
    "VAR_21": 43739,
    "return": 42046,
    "case": 41858,
    "|": 41478,
    "VAR_22": 40467,
    "VAR_23": 39090,
    "VAR_24": 34863,
    "VAR_25": 32797,
    "break": 32181,
    "VAR_1": 31866,
    "VAR_26": 31852,
    "else": 30198,
    "VAR_27": 30062,
    "VAR_28": 28488,
    "VAR_29": 26519,
    "VAR_0": 26463,
    "VAR_31": 25389,
    "VAR_30": 25066,
    "VAR_32": 23452,
    "#": 23362,
    "VAR_33": 22250,
    "VAR_34": 20961,
    "VAR_35": 20637,
    "for": 20164,
    "'": 19959,
    "VAR_36": 19938,
    "VAR_37": 19521,
    "NULL": 18894,
    "VAR_39": 18843,
    "VAR_38": 18247,
    "VAR_41": 17532,
    "VAR_40": 16822,
    "static": 16437,
    "void": 15815,
    "VAR_43": 15688,
    "VAR_42": 15387,
    "VAR_44": 15051,
    "VAR_45": 14758,
    "VAR_46": 14743,
    "const": 14581,
    "goto": 14210,
    "VAR_48": 13755,
    "VAR_47": 13633,
    "VAR_49": 12713,
    "VAR_51": 12212,
    "sizeof": 12178,
    "VAR_50": 12074,
    "VAR_52": 11580,
    "VAR_53": 11431,
    "VAR_55": 10799,
    "VAR_54": 10790,
    "/": 10320,
    "VAR_57": 10273,
    "VAR_58": 10197,
    "VAR_56": 10194,
    "VAR_59": 9506,
    "char": 9138,
    "VAR_60": 9085,
    "VAR_62": 8578,
    "VAR_61": 8306,
    "VAR_63": 8103,
    "VAR_65": 8004,
    "VAR_66": 7676,
    "?": 7504,
    "VAR_64": 7500,
    "VAR_69": 7416,
    "VAR_67": 7259,
    "VAR_70": 7000,
    "VAR_68": 6640,
    "VAR_71": 6342,
    "VAR_74": 6066,
    "VAR_72": 5995,
    "VAR_75": 5909,
    "VAR_76": 5796,
    "VAR_73": 5785,
    "unsigned": 5647,
    "switch": 5641,
    "VAR_77": 5619,
    "struct": 5422,
    "VAR_78": 5042,
    "VAR_79": 4829,
    "VAR_80": 4808,
    "VAR_81": 4796,
    "VAR_82": 4506,
    "VAR_83": 4493,
    "VAR_84": 4401,
    "VAR_85": 4351,
    "VAR_92": 4318,
    "VAR_86": 4213,
    "VAR_88": 4200,
    "VAR_87": 4067,
    "while": 4025,
    "VAR_90": 3988,
    "VAR_89": 3913,
    "VAR_91": 3882,
    "VAR_93": 3840,
    "VAR_94": 3669,
    "VAR_98": 3611,
    "~": 3611,
    "VAR_95": 3552,
    "VAR_99": 3408,
    "VAR_96": 3320,
    "VAR_97": 3299,
    "VAR_101": 3140,
    "VAR_100": 3016,
    "VAR_102": 2874,
    "VAR_112": 2823,
    "VAR_104": 2747,
    "VAR_103": 2738,
    "VAR_111": 2720,
    "VAR_107": 2633,
    "VAR_110": 2546,
    "VAR_106": 2505,
    "VAR_105": 2500,
    "VAR_109": 2481,
    "VAR_113": 2392,
    "VAR_108": 2371,
    "true": 2286,
    "VAR_114": 2277,
    "VAR_117": 2206,
    "VAR_119": 2133,
    "VAR_127": 2114,
    "false": 2021,
    "VAR_116": 2015,
    "VAR_125": 2003,
    "VAR_115": 1983,
    "continue": 1963,
    "VAR_121": 1944,
    "VAR_124": 1944,
    "VAR_120": 1921,
    "VAR_118": 1910,
    "VAR_128": 1839,
    "float": 1825,
    "VAR_126": 1789,
    "VAR_123": 1761,
    "$": 1745,
    "VAR_122": 1709,
    "long": 1708,
    "VAR_129": 1692,
    "VAR_130": 1617,
    "VAR_132": 1584,
    "VAR_131": 1494,
    "VAR_135": 1473,
    "VAR_133": 1452,
    "VAR_147": 1438,
    "VAR_134": 1362,
    "VAR_144": 1339,
    "VAR_138": 1331,
