{
  "config": {
    "min_freq": 2,
    "max_vocab_size": 50000,
    "special_tokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>"
    ],
    "lowercase": false
  },
  "token2id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "(": 4,
    ";": 5,
    ")": 6,
    ",": 7,
    "NUM": 8,
    "->": 9,
    "=": 10,
    "VAR_0": 11,
    "VAR_1": 12,
    "VAR_2": 13,
    "[": 14,
    "]": 15,
    "VAR_3": 16,
    "VAR_4": 17,
    "VAR_5": 18,
    "{": 19,
    "*": 20,
    "VAR_6": 21,
    "}": 22,
    "if": 23,
    "VAR_7": 24,
    "STR": 25,
    "VAR_8": 26,
    "&": 27,
    "VAR_9": 28,
    ".": 29,
    "VAR_10": 30,
    "VAR_11": 31,
    "+": 32,
    "VAR_12": 33,
    "VAR_13": 34,
    "VAR_14": 35,
    "VAR_15": 36,
    "-": 37,
    "VAR_16": 38,
    "<": 39,
    "VAR_17": 40,
    "int": 41,
    "VAR_18": 42,
    "==": 43,
    "++": 44,
    "VAR_19": 45,
    "return": 46,
    "VAR_20": 47,
    ":": 48,
    "VAR_21": 49,
    "!": 50,
    "for": 51,
    "VAR_22": 52,
    "#": 53,
    "else": 54,
    "VAR_23": 55,
    "VAR_24": 56,
    "NULL": 57,
    "&&": 58,
    "VAR_25": 59,
    ">>": 60,
    "VAR_26": 61,
    "+=": 62,
    "VAR_27": 63,
    "<<": 64,
    "VAR_28": 65,
    "!=": 66,
    "VAR_29": 67,
    "sizeof": 68,
    "VAR_30": 69,
    "const": 70,
    "||": 71,
    "VAR_31": 72,
    ">": 73,
    "|": 74,
    "static": 75,
    "VAR_32": 76,
    "\\": 77,
    "break": 78,
    "case": 79,
    "VAR_33": 80,
    "void": 81,
    "VAR_34": 82,
    "/": 83,
    "VAR_35": 84,
    "VAR_36": 85,
    "%": 86,
    "VAR_38": 87,
    "char": 88,
    "VAR_37": 89,
    "?": 90,
    ">=": 91,
    "VAR_39": 92,
    "CHAR": 93,
    "VAR_40": 94,
    "goto": 95,
    "VAR_41": 96,
    "|=": 97,
    "while": 98,
    "VAR_42": 99,
    "VAR_43": 100,
    "unsigned": 101,
    "struct": 102,
    "~": 103,
    "VAR_44": 104,
    "VAR_45": 105,
    "<=": 106,
    "VAR_46": 107,
    "fprintf": 108,
    "VAR_47": 109,
    "VAR_48": 110,
    "-=": 111,
    "VAR_49": 112,
    "VAR_56": 113,
    "switch": 114,
    "VAR_53": 115,
    "true": 116,
    "VAR_50": 117,
    "VAR_51": 118,
    "memcpy": 119,
    "VAR_52": 120,
    "VAR_59": 121,
    "--": 122,
    "VAR_55": 123,
    "false": 124,
    "&=": 125,
    "VAR_54": 126,
    "VAR_58": 127,
    "memset": 128,
    "VAR_57": 129,
    "long": 130,
    "float": 131,
    "VAR_60": 132,
    "strcmp": 133,
    "VAR_62": 134,
    "VAR_69": 135,
    "VAR_61": 136,
    "VAR_63": 137,
    "VAR_64": 138,
    "printf": 139,
    "VAR_66": 140,
    "VAR_65": 141,
    "VAR_67": 142,
    "VAR_68": 143,
    "VAR_70": 144,
    "VAR_72": 145,
    "continue": 146,
    "strlen": 147,
    "VAR_77": 148,
    "double": 149,
    "^": 150,
    "VAR_71": 151,
    "snprintf": 152,
    "VAR_73": 153,
    "VAR_78": 154,
    "VAR_76": 155,
    "VAR_74": 156,
    "VAR_92": 157,
    "*=": 158,
    "VAR_79": 159,
    "VAR_80": 160,
    "VAR_111": 161,
    "signed": 162,
    "VAR_82": 163,
    "VAR_83": 164,
    "VAR_75": 165,
    "VAR_81": 166,
    "VAR_84": 167,
    "close": 168,
    "short": 169,
    "VAR_85": 170,
    "VAR_87": 171,
    "VAR_91": 172,
    "VAR_86": 173,
    "VAR_90": 174,
    "VAR_88": 175,
    "VAR_89": 176,
    "VAR_107": 177,
    "VAR_110": 178,
    "free": 179,
    "VAR_116": 180,
    "VAR_94": 181,
    "VAR_109": 182,
    "VAR_95": 183,
    "VAR_103": 184,
    "VAR_93": 185,
    "VAR_106": 186,
    "VAR_97": 187,
    "strncmp": 188,
    "VAR_102": 189,
    "VAR_101": 190,
    "VAR_100": 191,
    "VAR_112": 192,
    "memcmp": 193,
    "VAR_98": 194,
    "sscanf": 195,
    "VAR_96": 196,
    "VAR_99": 197,
    "enum": 198,
    "/=": 199,
    "^=": 200,
    "VAR_105": 201,
    "write": 202,
    "VAR_108": 203,
    "VAR_118": 204,
    "VAR_104": 205,
    "strcpy": 206,
    "VAR_114": 207,
    "memmove": 208,
    "read": 209,
    "fclose": 210,
    "fopen": 211,
    "VAR_115": 212,
    "open": 213,
    "VAR_117": 214,
    "VAR_113": 215,
    "malloc": 216,
    "sprintf": 217,
    "strncpy": 218,
    "%=": 219,
    "fwrite": 220,
    "puts": 221,
    "fread": 222,
    "union": 223,
    "strcat": 224,
    "vsnprintf": 225,
    "fgets": 226,
    "strncat": 227,
    "realloc": 228,
    "calloc": 229,
    "typedef": 230,
    "<empty>": 231,
    "alloca": 232,
    "extern": 233,
    "fscanf": 234,
    "memchr": 235,
    "fputs": 236,
    "getchar": 237
  },
  "id2token": [
    "<PAD>",
    "<UNK>",
    "<BOS>",
    "<EOS>",
    "(",
    ";",
    ")",
    ",",
    "NUM",
    "->",
    "=",
    "VAR_0",
    "VAR_1",
    "VAR_2",
    "[",
    "]",
    "VAR_3",
    "VAR_4",
    "VAR_5",
    "{",
    "*",
    "VAR_6",
    "}",
    "if",
    "VAR_7",
    "STR",
    "VAR_8",
    "&",
    "VAR_9",
    ".",
    "VAR_10",
    "VAR_11",
    "+",
    "VAR_12",
    "VAR_13",
    "VAR_14",
    "VAR_15",
    "-",
    "VAR_16",
    "<",
    "VAR_17",
    "int",
    "VAR_18",
    "==",
    "++",
    "VAR_19",
    "return",
    "VAR_20",
    ":",
    "VAR_21",
    "!",
    "for",
    "VAR_22",
    "#",
    "else",
    "VAR_23",
    "VAR_24",
    "NULL",
    "&&",
    "VAR_25",
    ">>",
    "VAR_26",
    "+=",
    "VAR_27",
    "<<",
    "VAR_28",
    "!=",
    "VAR_29",
    "sizeof",
    "VAR_30",
    "const",
    "||",
    "VAR_31",
    ">",
    "|",
    "static",
    "VAR_32",
    "\\",
    "break",
    "case",
    "VAR_33",
    "void",
    "VAR_34",
    "/",
    "VAR_35",
    "VAR_36",
    "%",
    "VAR_38",
    "char",
    "VAR_37",
    "?",
    ">=",
    "VAR_39",
    "CHAR",
    "VAR_40",
    "goto",
    "VAR_41",
    "|=",
    "while",
    "VAR_42",
    "VAR_43",
    "unsigned",
    "struct",
    "~",
    "VAR_44",
    "VAR_45",
    "<=",
    "VAR_46",
    "fprintf",
    "VAR_47",
    "VAR_48",
    "-=",
    "VAR_49",
    "VAR_56",
    "switch",
    "VAR_53",
    "true",
    "VAR_50",
    "VAR_51",
    "memcpy",
    "VAR_52",
    "VAR_59",
    "--",
    "VAR_55",
    "false",
    "&=",
    "VAR_54",
    "VAR_58",
    "memset",
    "VAR_57",
    "long",
    "float",
    "VAR_60",
    "strcmp",
    "VAR_62",
    "VAR_69",
    "VAR_61",
    "VAR_63",
    "VAR_64",
    "printf",
    "VAR_66",
    "VAR_65",
    "VAR_67",
    "VAR_68",
    "VAR_70",
    "VAR_72",
    "continue",
    "strlen",
    "VAR_77",
    "double",
    "^",
    "VAR_71",
    "snprintf",
    "VAR_73",
    "VAR_78",
    "VAR_76",
    "VAR_74",
    "VAR_92",
    "*=",
    "VAR_79",
    "VAR_80",
    "VAR_111",
    "signed",
    "VAR_82",
    "VAR_83",
    "VAR_75",
    "VAR_81",
    "VAR_84",
    "close",
    "short",
    "VAR_85",
    "VAR_87",
    "VAR_91",
    "VAR_86",
    "VAR_90",
    "VAR_88",
    "VAR_89",
    "VAR_107",
    "VAR_110",
    "free",
    "VAR_116",
    "VAR_94",
    "VAR_109",
    "VAR_95",
    "VAR_103",
    "VAR_93",
    "VAR_106",
    "VAR_97",
    "strncmp",
    "VAR_102",
    "VAR_101",
    "VAR_100",
    "VAR_112",
    "memcmp",
    "VAR_98",
    "sscanf",
    "VAR_96",
    "VAR_99",
    "enum",
    "/=",
    "^=",
    "VAR_105",
    "write",
    "VAR_108",
    "VAR_118",
    "VAR_104",
    "strcpy",
    "VAR_114",
    "memmove",
    "read",
    "fclose",
    "fopen",
    "VAR_115",
    "open",
    "VAR_117",
    "VAR_113",
    "malloc",
    "sprintf",
    "strncpy",
    "%=",
    "fwrite",
    "puts",
    "fread",
    "union",
    "strcat",
    "vsnprintf",
    "fgets",
    "strncat",
    "realloc",
    "calloc",
    "typedef",
    "<empty>",
    "alloca",
    "extern",
    "fscanf",
    "memchr",
    "fputs",
    "getchar"
  ],
  "token_freqs": {
    "<PAD>": 0,
    "<UNK>": 0,
    "<BOS>": 0,
    "<EOS>": 0,
    "(": 364918,
    ";": 364219,
    ")": 363229,
    ",": 284924,
    "NUM": 247416,
    "->": 228427,
    "=": 186901,
    "VAR_0": 148753,
    "VAR_1": 134917,
    "VAR_2": 116133,
    "[": 106520,
    "]": 106519,
    "VAR_3": 104490,
    "VAR_4": 95969,
    "VAR_5": 89125,
    "{": 88073,
    "*": 85976,
    "VAR_6": 76878,
    "}": 76798,
    "if": 74183,
    "VAR_7": 69209,
    "STR": 65803,
    "VAR_8": 61598,
    "&": 58326,
    "VAR_9": 56235,
    ".": 50143,
    "VAR_10": 49912,
    "VAR_11": 44938,
    "+": 41796,
    "VAR_12": 40657,
    "VAR_13": 36983,
    "VAR_14": 32949,
    "VAR_15": 30239,
    "-": 28710,
    "VAR_16": 27479,
    "<": 24871,
    "VAR_17": 24650,
    "int": 23374,
    "VAR_18": 22559,
    "==": 22086,
    "++": 20009,
    "VAR_19": 19803,
    "return": 19385,
    "VAR_20": 17945,
    ":": 17133,
    "VAR_21": 16590,
    "!": 15665,
    "for": 15570,
    "VAR_22": 15204,
    "#": 14613,
    "else": 14525,
    "VAR_23": 13617,
    "VAR_24": 12754,
    "NULL": 12719,
    "&&": 12648,
    "VAR_25": 11424,
    ">>": 11042,
    "VAR_26": 10636,
    "+=": 10420,
    "VAR_27": 9744,
    "<<": 9644,
    "VAR_28": 9466,
    "!=": 8661,
    "VAR_29": 8466,
    "sizeof": 7970,
    "VAR_30": 7625,
    "const": 7433,
    "||": 7355,
    "VAR_31": 7096,
    ">": 6927,
    "|": 6795,
    "static": 6602,
    "VAR_32": 6382,
    "\\": 6364,
    "break": 6306,
    "case": 6285,
    "VAR_33": 6230,
    "void": 6158,
    "VAR_34": 5752,
    "/": 5268,
    "VAR_35": 5155,
    "VAR_36": 4780,
    "%": 4772,
    "VAR_38": 4616,
    "char": 4559,
    "VAR_37": 4323,
    "?": 4259,
    ">=": 4128,
    "VAR_39": 3863,
    "CHAR": 3488,
    "VAR_40": 3482,
    "goto": 3399,
    "VAR_41": 3249,
    "|=": 3118,
    "while": 3099,
    "VAR_42": 2867,
    "VAR_43": 2862,
    "unsigned": 2789,
    "struct": 2642,
    "~": 2482,
    "VAR_44": 2467,
    "VAR_45": 2360,
    "<=": 2357,
    "VAR_46": 2255,
    "fprintf": 2230,
    "VAR_47": 2086,
    "VAR_48": 1963,
    "-=": 1930,
    "VAR_49": 1895,
    "VAR_56": 1831,
    "switch": 1813,
    "VAR_53": 1759,
    "true": 1753,
    "VAR_50": 1739,
    "VAR_51": 1684,
    "memcpy": 1570,
    "VAR_52": 1517,
    "VAR_59": 1465,
    "--": 1454,
    "VAR_55": 1454,
    "false": 1424,
    "&=": 1418,
    "VAR_54": 1392,
    "VAR_58": 1347,
    "memset": 1344,
    "VAR_57": 1197,
    "long": 1164,
    "float": 1116,
    "VAR_60": 1107,
    "strcmp": 1083,
    "VAR_62": 1048,
    "VAR_69": 1039,
    "VAR_61": 1037,
    "VAR_63": 1011,
    "VAR_64": 925,
    "printf": 882,
    "VAR_66": 852,
    "VAR_65": 847,
    "VAR_67": 785,
    "VAR_68": 749,
    "VAR_70": 718,
    "VAR_72": 711,
    "continue": 704,
    "strlen": 694,
    "VAR_77": 685,
    "double": 676,
    "^": 672,
    "VAR_71": 645,
    "snprintf": 634,
    "VAR_73": 632,
    "VAR_78": 627,
    "VAR_76": 524,
    "VAR_74": 484,
    "VAR_92": 482,
    "*=": 481,
    "VAR_79": 458,
    "VAR_80": 458,
    "VAR_111": 429,
    "signed": 404,
    "VAR_82": 402,
    "VAR_83": 401,
    "VAR_75": 394,
    "VAR_81": 388,
    "VAR_84": 379,
    "close": 378,
    "short": 352,
    "VAR_85": 336,
    "VAR_87": 335,
    "VAR_91": 330,
    "VAR_86": 329,
    "VAR_90": 322,
    "VAR_88": 294,
    "VAR_89": 290,
    "VAR_107": 289,
    "VAR_110": 284,
    "free": 260,
    "VAR_116": 251,
    "VAR_94": 246,
    "VAR_109": 245,
    "VAR_95": 243,
    "VAR_103": 239,
    "VAR_93": 231,
    "VAR_106": 226,
    "VAR_97": 218,
    "strncmp": 216,
    "VAR_102": 209,
    "VAR_101": 203,
    "VAR_100": 196,
    "VAR_112": 194,
    "memcmp": 192,
    "VAR_98": 189,
    "sscanf": 184,
    "VAR_96": 183,
    "VAR_99": 181,
    "enum": 174,
    "/=": 170,
    "^=": 163,
    "VAR_105": 156,
    "write": 156,
    "VAR_108": 155,
    "VAR_118": 146,
    "VAR_104": 138,
    "strcpy": 124,
    "VAR_114": 115,
    "memmove": 115,
    "read": 112,
    "fclose": 109,
    "fopen": 105,
    "VAR_115": 102,
    "open": 99,
    "VAR_117": 96,
    "VAR_113": 95,
    "malloc": 84,
    "sprintf": 80,
    "strncpy": 74,
    "%=": 54,
    "fwrite": 44,
    "puts": 42,
    "fread": 32,
    "union": 32,
    "strcat": 26,
    "vsnprintf": 21,
    "fgets": 20,
    "strncat": 17,
    "realloc": 15,
    "calloc": 12,
    "typedef": 9,
    "<empty>": 8,
    "alloca": 8,
    "extern": 8,
    "fscanf": 8,
    "memchr": 5,
    "fputs": 3,
    "getchar": 2
  }
}