{
  "config": {
    "min_freq": 2,
    "max_vocab_size": 50000,
    "special_tokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>"
    ],
    "lowercase": false
  },
  "token2id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "(": 4,
    ")": 5,
    ";": 6,
    ",": 7,
    "NUM": 8,
    "->": 9,
    "=": 10,
    "VAR_2": 11,
    "*": 12,
    "VAR_4": 13,
    "{": 14,
    "VAR_3": 15,
    "VAR_0": 16,
    "[": 17,
    "]": 18,
    "VAR_5": 19,
    "if": 20,
    "VAR_6": 21,
    "VAR_1": 22,
    "VAR_7": 23,
    "VAR_8": 24,
    "VAR_9": 25,
    "}": 26,
    "&": 27,
    "VAR_10": 28,
    "STR": 29,
    "VAR_11": 30,
    ".": 31,
    "VAR_12": 32,
    "VAR_13": 33,
    "VAR_14": 34,
    "VAR_15": 35,
    "int": 36,
    "+": 37,
    "VAR_16": 38,
    ":": 39,
    "VAR_17": 40,
    "-": 41,
    "<": 42,
    "VAR_18": 43,
    "==": 44,
    "VAR_19": 45,
    "VAR_20": 46,
    "return": 47,
    "++": 48,
    "case": 49,
    "VAR_21": 50,
    "!": 51,
    "VAR_22": 52,
    "VAR_23": 53,
    "static": 54,
    "for": 55,
    "VAR_24": 56,
    "void": 57,
    "&&": 58,
    "break": 59,
    "VAR_25": 60,
    "NULL": 61,
    "VAR_27": 62,
    "VAR_26": 63,
    "else": 64,
    "const": 65,
    "#": 66,
    "VAR_28": 67,
    "!=": 68,
    "VAR_30": 69,
    "VAR_29": 70,
    ">>": 71,
    "VAR_31": 72,
    "<<": 73,
    "sizeof": 74,
    "||": 75,
    "+=": 76,
    "VAR_32": 77,
    "VAR_33": 78,
    ">": 79,
    "char": 80,
    "VAR_34": 81,
    "VAR_38": 82,
    "VAR_36": 83,
    "VAR_35": 84,
    "VAR_37": 85,
    "|": 86,
    "goto": 87,
    "VAR_39": 88,
    "/": 89,
    "VAR_40": 90,
    "VAR_42": 91,
    "CHAR": 92,
    "VAR_41": 93,
    "VAR_43": 94,
    ">=": 95,
    "?": 96,
    "VAR_44": 97,
    "\\": 98,
    "VAR_46": 99,
    "VAR_45": 100,
    "%": 101,
    "struct": 102,
    "unsigned": 103,
    "VAR_47": 104,
    "VAR_49": 105,
    "switch": 106,
    "VAR_48": 107,
    "while": 108,
    "|=": 109,
    "VAR_50": 110,
    "VAR_51": 111,
    "VAR_53": 112,
    "VAR_56": 113,
    "VAR_52": 114,
    "VAR_55": 115,
    "~": 116,
    "VAR_57": 117,
    "VAR_54": 118,
    "<=": 119,
    "fprintf": 120,
    "VAR_59": 121,
    "VAR_58": 122,
    "VAR_61": 123,
    "VAR_62": 124,
    "VAR_69": 125,
    "VAR_60": 126,
    "VAR_64": 127,
    "-=": 128,
    "true": 129,
    "VAR_68": 130,
    "VAR_65": 131,
    "&=": 132,
    "VAR_63": 133,
    "VAR_66": 134,
    "VAR_67": 135,
    "strcmp": 136,
    "false": 137,
    "VAR_70": 138,
    "VAR_72": 139,
    "VAR_71": 140,
    "--": 141,
    "memcpy": 142,
    "VAR_77": 143,
    "memset": 144,
    "VAR_73": 145,
    "long": 146,
    "float": 147,
    "VAR_75": 148,
    "VAR_74": 149,
    "VAR_76": 150,
    "VAR_78": 151,
    "VAR_83": 152,
    "VAR_79": 153,
    "VAR_80": 154,
    "printf": 155,
    "VAR_82": 156,
    "VAR_81": 157,
    "strlen": 158,
    "VAR_100": 159,
    "VAR_84": 160,
    "snprintf": 161,
    "VAR_90": 162,
    "double": 163,
    "VAR_85": 164,
    "^": 165,
    "continue": 166,
    "VAR_89": 167,
    "VAR_86": 168,
    "VAR_87": 169,
    "VAR_91": 170,
    "VAR_95": 171,
    "VAR_88": 172,
    "VAR_98": 173,
    "VAR_97": 174,
    "VAR_94": 175,
    "VAR_102": 176,
    "*=": 177,
    "VAR_96": 178,
    "VAR_104": 179,
    "VAR_92": 180,
    "VAR_108": 181,
    "VAR_109": 182,
    "VAR_106": 183,
    "VAR_99": 184,
    "VAR_103": 185,
    "VAR_107": 186,
    "VAR_105": 187,
    "VAR_93": 188,
    "VAR_101": 189,
    "enum": 190,
    "VAR_120": 191,
    "VAR_112": 192,
    "VAR_110": 193,
    "close": 194,
    "VAR_118": 195,
    "VAR_122": 196,
    "VAR_115": 197,
    "VAR_121": 198,
    "VAR_114": 199,
    "VAR_111": 200,
    "short": 201,
    "signed": 202,
    "VAR_119": 203,
    "VAR_123": 204,
    "VAR_124": 205,
    "VAR_113": 206,
    "^=": 207,
    "VAR_117": 208,
    "memcmp": 209,
    "strncmp": 210,
    "VAR_116": 211,
    "free": 212,
    "/=": 213,
    "sscanf": 214,
    "write": 215,
    "read": 216,
    "fopen": 217,
    "open": 218,
    "malloc": 219,
    "strcpy": 220,
    "memmove": 221,
    "strncpy": 222,
    "sprintf": 223,
    "fclose": 224,
    "%=": 225,
    "union": 226,
    "fread": 227,
    "puts": 228,
    "realloc": 229,
    "fgets": 230,
    "fwrite": 231,
    "strcat": 232,
    "alloca": 233,
    "extern": 234,
    "calloc": 235,
    "vsnprintf": 236,
    "strncat": 237,
    "memchr": 238,
    "fscanf": 239,
    "scanf": 240,
    "typedef": 241
  },
  "id2token": [
    "<PAD>",
    "<UNK>",
    "<BOS>",
    "<EOS>",
    "(",
    ")",
    ";",
    ",",
    "NUM",
    "->",
    "=",
    "VAR_2",
    "*",
    "VAR_4",
    "{",
    "VAR_3",
    "VAR_0",
    "[",
    "]",
    "VAR_5",
    "if",
    "VAR_6",
    "VAR_1",
    "VAR_7",
    "VAR_8",
    "VAR_9",
    "}",
    "&",
    "VAR_10",
    "STR",
    "VAR_11",
    ".",
    "VAR_12",
    "VAR_13",
    "VAR_14",
    "VAR_15",
    "int",
    "+",
    "VAR_16",
    ":",
    "VAR_17",
    "-",
    "<",
    "VAR_18",
    "==",
    "VAR_19",
    "VAR_20",
    "return",
    "++",
    "case",
    "VAR_21",
    "!",
    "VAR_22",
    "VAR_23",
    "static",
    "for",
    "VAR_24",
    "void",
    "&&",
    "break",
    "VAR_25",
    "NULL",
    "VAR_27",
    "VAR_26",
    "else",
    "const",
    "#",
    "VAR_28",
    "!=",
    "VAR_30",
    "VAR_29",
    ">>",
    "VAR_31",
    "<<",
    "sizeof",
    "||",
    "+=",
    "VAR_32",
    "VAR_33",
    ">",
    "char",
    "VAR_34",
    "VAR_38",
    "VAR_36",
    "VAR_35",
    "VAR_37",
    "|",
    "goto",
    "VAR_39",
    "/",
    "VAR_40",
    "VAR_42",
    "CHAR",
    "VAR_41",
    "VAR_43",
    ">=",
    "?",
    "VAR_44",
    "\\",
    "VAR_46",
    "VAR_45",
    "%",
    "struct",
    "unsigned",
    "VAR_47",
    "VAR_49",
    "switch",
    "VAR_48",
    "while",
    "|=",
    "VAR_50",
    "VAR_51",
    "VAR_53",
    "VAR_56",
    "VAR_52",
    "VAR_55",
    "~",
    "VAR_57",
    "VAR_54",
    "<=",
    "fprintf",
    "VAR_59",
    "VAR_58",
    "VAR_61",
    "VAR_62",
    "VAR_69",
    "VAR_60",
    "VAR_64",
    "-=",
    "true",
    "VAR_68",
    "VAR_65",
    "&=",
    "VAR_63",
    "VAR_66",
    "VAR_67",
    "strcmp",
    "false",
    "VAR_70",
    "VAR_72",
    "VAR_71",
    "--",
    "memcpy",
    "VAR_77",
    "memset",
    "VAR_73",
    "long",
    "float",
    "VAR_75",
    "VAR_74",
    "VAR_76",
    "VAR_78",
    "VAR_83",
    "VAR_79",
    "VAR_80",
    "printf",
    "VAR_82",
    "VAR_81",
    "strlen",
    "VAR_100",
    "VAR_84",
    "snprintf",
    "VAR_90",
    "double",
    "VAR_85",
    "^",
    "continue",
    "VAR_89",
    "VAR_86",
    "VAR_87",
    "VAR_91",
    "VAR_95",
    "VAR_88",
    "VAR_98",
    "VAR_97",
    "VAR_94",
    "VAR_102",
    "*=",
    "VAR_96",
    "VAR_104",
    "VAR_92",
    "VAR_108",
    "VAR_109",
    "VAR_106",
    "VAR_99",
    "VAR_103",
    "VAR_107",
    "VAR_105",
    "VAR_93",
    "VAR_101",
    "enum",
    "VAR_120",
    "VAR_112",
    "VAR_110",
    "close",
    "VAR_118",
    "VAR_122",
    "VAR_115",
    "VAR_121",
    "VAR_114",
    "VAR_111",
    "short",
    "signed",
    "VAR_119",
    "VAR_123",
    "VAR_124",
    "VAR_113",
    "^=",
    "VAR_117",
    "memcmp",
    "strncmp",
    "VAR_116",
    "free",
    "/=",
    "sscanf",
    "write",
    "read",
    "fopen",
    "open",
    "malloc",
    "strcpy",
    "memmove",
    "strncpy",
    "sprintf",
    "fclose",
    "%=",
    "union",
    "fread",
    "puts",
    "realloc",
    "fgets",
    "fwrite",
    "strcat",
    "alloca",
    "extern",
    "calloc",
    "vsnprintf",
    "strncat",
    "memchr",
    "fscanf",
    "scanf",
    "typedef"
  ],
  "token_freqs": {
    "<PAD>": 0,
    "<UNK>": 0,
    "<BOS>": 0,
    "<EOS>": 0,
    "(": 191028,
    ")": 188972,
    ";": 186904,
    ",": 140783,
    "NUM": 118036,
    "->": 114684,
    "=": 96686,
    "VAR_2": 64132,
    "*": 55266,
    "VAR_4": 52272,
    "{": 47612,
    "VAR_3": 47398,
    "VAR_0": 46948,
    "[": 45134,
    "]": 45133,
    "VAR_5": 43653,
    "if": 42973,
    "VAR_6": 41275,
    "VAR_1": 40463,
    "VAR_7": 37485,
    "VAR_8": 34079,
    "VAR_9": 31246,
    "}": 30185,
    "&": 28889,
    "VAR_10": 27003,
    "STR": 25270,
    "VAR_11": 24691,
    ".": 24463,
    "VAR_12": 22518,
    "VAR_13": 20324,
    "VAR_14": 18538,
    "VAR_15": 17461,
    "int": 17357,
    "+": 16576,
    "VAR_16": 14983,
    ":": 14383,
    "VAR_17": 13969,
    "-": 13478,
    "<": 12989,
    "VAR_18": 12844,
    "==": 12668,
    "VAR_19": 11920,
    "VAR_20": 11075,
    "return": 9872,
    "++": 9802,
    "case": 9788,
    "VAR_21": 9421,
    "!": 9241,
    "VAR_22": 9178,
    "VAR_23": 8688,
    "static": 7808,
    "for": 7791,
    "VAR_24": 7658,
    "void": 7389,
    "&&": 7098,
    "break": 6960,
    "VAR_25": 6924,
    "NULL": 6589,
    "VAR_27": 6048,
    "VAR_26": 5897,
    "else": 5833,
    "const": 5476,
    "#": 5312,
    "VAR_28": 5226,
    "!=": 5188,
    "VAR_30": 4770,
    "VAR_29": 4681,
    ">>": 4638,
    "VAR_31": 4545,
    "<<": 4364,
    "sizeof": 4274,
    "||": 4266,
    "+=": 4124,
    "VAR_32": 4061,
    "VAR_33": 3883,
    ">": 3827,
    "char": 3774,
    "VAR_34": 3737,
    "VAR_38": 3427,
    "VAR_36": 3402,
    "VAR_35": 3286,
    "VAR_37": 3187,
    "|": 3167,
    "goto": 3001,
    "VAR_39": 2736,
    "/": 2474,
    "VAR_40": 2457,
    "VAR_42": 2441,
    "CHAR": 2376,
    "VAR_41": 2334,
    "VAR_43": 2304,
    ">=": 2175,
    "?": 2075,
    "VAR_44": 2069,
    "\\": 2023,
    "VAR_46": 2004,
    "VAR_45": 1984,
    "%": 1974,
    "struct": 1885,
    "unsigned": 1871,
    "VAR_47": 1806,
    "VAR_49": 1720,
    "switch": 1688,
    "VAR_48": 1677,
    "while": 1673,
    "|=": 1653,
    "VAR_50": 1540,
    "VAR_51": 1437,
    "VAR_53": 1430,
    "VAR_56": 1407,
    "VAR_52": 1274,
    "VAR_55": 1274,
    "~": 1257,
    "VAR_57": 1243,
    "VAR_54": 1242,
    "<=": 1228,
    "fprintf": 1154,
    "VAR_59": 1126,
    "VAR_58": 1113,
    "VAR_61": 1109,
    "VAR_62": 1013,
    "VAR_69": 1010,
    "VAR_60": 995,
    "VAR_64": 950,
    "-=": 877,
    "true": 830,
    "VAR_68": 803,
    "VAR_65": 802,
    "&=": 785,
    "VAR_63": 774,
    "VAR_66": 750,
    "VAR_67": 735,
    "strcmp": 732,
    "false": 718,
    "VAR_70": 714,
    "VAR_72": 693,
    "VAR_71": 691,
    "--": 665,
    "memcpy": 650,
    "VAR_77": 592,
    "memset": 580,
    "VAR_73": 572,
    "long": 571,
    "float": 555,
    "VAR_75": 544,
    "VAR_74": 528,
    "VAR_76": 499,
    "VAR_78": 473,
    "VAR_83": 452,
    "VAR_79": 448,
    "VAR_80": 415,
    "printf": 406,
    "VAR_82": 404,
    "VAR_81": 390,
    "strlen": 383,
    "VAR_100": 371,
    "VAR_84": 371,
    "snprintf": 368,
    "VAR_90": 353,
    "double": 334,
    "VAR_85": 316,
    "^": 315,
    "continue": 302,
    "VAR_89": 295,
    "VAR_86": 289,
    "VAR_87": 283,
    "VAR_91": 278,
    "VAR_95": 278,
    "VAR_88": 274,
    "VAR_98": 260,
    "VAR_97": 251,
    "VAR_94": 241,
    "VAR_102": 236,
    "*=": 227,
    "VAR_96": 227,
    "VAR_104": 221,
    "VAR_92": 209,
    "VAR_108": 206,
    "VAR_109": 205,
    "VAR_106": 204,
    "VAR_99": 198,
    "VAR_103": 194,
    "VAR_107": 189,
    "VAR_105": 182,
    "VAR_93": 181,
    "VAR_101": 179,
    "enum": 175,
    "VAR_120": 161,
    "VAR_112": 159,
    "VAR_110": 156,
    "close": 153,
    "VAR_118": 148,
    "VAR_122": 144,
    "VAR_115": 143,
    "VAR_121": 140,
    "VAR_114": 137,
    "VAR_111": 136,
    "short": 133,
    "signed": 132,
    "VAR_119": 124,
    "VAR_123": 123,
    "VAR_124": 123,
    "VAR_113": 114,
    "^=": 113,
    "VAR_117": 110,
    "memcmp": 110,
    "strncmp": 108,
    "VAR_116": 104,
    "free": 101,
    "/=": 81,
    "sscanf": 77,
    "write": 66,
    "read": 64,
    "fopen": 63,
    "open": 62,
    "malloc": 43,
    "strcpy": 42,
    "memmove": 40,
    "strncpy": 40,
    "sprintf": 32,
    "fclose": 30,
    "%=": 22,
    "union": 18,
    "fread": 15,
    "puts": 11,
    "realloc": 10,
    "fgets": 9,
    "fwrite": 9,
    "strcat": 9,
    "alloca": 7,
    "extern": 7,
    "calloc": 6,
    "vsnprintf": 6,
    "strncat": 5,
    "memchr": 4,
    "fscanf": 3,
    "scanf": 2,
    "typedef": 2
  }
}